{
  "Wompy Womp Random Sexy Edition": {
    "root": "E:\\SteamLibrary\\steamapps\\common\\Palworld\\Pal\\Content\\Paks",
    "version": "v4",
    "file_id": "local",
    "file_name": "Wompy Womp Random Sexy Edition v4.7z",
    "entries\"": [
      "LogicMods/",
      "LogicMods\\WompyWompRandomSexy.pak"
    ],
    "local": true,
    "author": "Spirit_Shard",
    "description": "[url=https://www.loverslab.com/files/file/37233-wompy-womp-random-sexy-edition/]https://www.loverslab.com/files/file/37233-wompy-womp-random-sexy-edition/[/url]\n[b]~-~ Wompy Womp - Random Sexy Edition  ~-~[/b]\nCreated and Maintained by : Michael \"Spirit Shard\" Stanich\nDiscord - The Broken Chatbox - [url=https://discord.gg/h3vB7S4FEw]https://discord.gg/h3vB7S4FEw[/url]\nWebsite - [url=https://www.michaelpstanich.com/]https://www.michaelpstanich.com/[/url]\nTBC Thread - [url=https://forum.thebrokenchatbox.com/d/30-wompy-womp-random-sexy-edition-palworld-mod]https://forum.thebrokenchatbox.com/d/30-wompy-womp-random-sexy-edition-palworld-mod[/url]\n[b]v (Donations! =^-^=) v[/b]\nSubscribeStar - [url=https://subscribestar.adult/michaelpstanich]https://subscribestar.adult/michaelpstanich[/url]\n[img]https://static.loverslab.com/screenshots/monthly_2024_10/WompyWomp_Cover.png.3c1de9d13fb358283a823fdcc0b253cf.png[/img][/url]\n[b]WOMPY WOMP! They want to womp, make them womp with wompy womp! Fill with wompage, make the wompening, Become The Womper.[/b]\nWompy Womp - Random Sexy Edition is a quick gameplay sample built in Blueprints to show how quickly and easily you can set up complex matchmaking and initiate animations using the SCake API. Effectively this gameplay module just periodically attempts to start random erotic animations within a certain distance from the player with the added functionality of automatically having characters 'join' the player if the player is currently in a solo animation. The goal of Wompy Womp's Random Sexy Edition was to create a simple example with usable gameplay within just a few hours of dev time, then provide the source as an example for others to see. The current version, as of writing, was done in a single day with 4.5 hours logged total in prototyping, testing, then refining and refactoring along with some polish to make it reasonably usable. It's not perfect, but acts as a good sample of how quickly you can get something up and running and then iterate/expand from there.\n[b]~-~ A Quick Thank You! ~-~[/b]\nI want to give a quick thank you to some community members in our Discord that helped test and suggest things for Wompy Womp, and a thank you to Shenova specifically for suggesting the idea while I didn't have anything better to do, apparently. (The idea had been suggested before and we've gotten a lot of ideas and suggestions over time, thank you for all your participation, now it's time to make these suggestions reality!)\n[b]~-~ Self Promotion ~-~[/b]\nI'm getting use to promoting my SubscribeStar everywhere ( [url=https://subscribestar.adult/michaelpstanich]https://subscribestar.adult/michaelpstanich[/url] ) and if you like my work and wish to see more of it I certainly suggest donating/subscribing so I can dedicate more time to this kind of work! But I also want to give a huge shout out to our welcoming community and our Discord, The Broken Chatbox! ( [url=https://discord.gg/h3vB7S4FEw]https://discord.gg/h3vB7S4FEw[/url] ) Over in the Discord you not only get to interact with all the lovely creatives we have there, but also get to see projects like Wompy Womp as they are actively being developed! It's also a great place for collaboration in a format not quite possible on forums or private message platforms. If you're interested in follow these developments, or you're a creative yourself with these kinds of interests, feel free to join and participate as much, or as little, as you want!\n[b]~-~ Features ~-~[/b]\nNote : Wompy Womp is more a proof of concept than a full fledged mod, please temper expectations\n&lt;&gt; Wompy Womp will periodically scan for potential wompers, first Wompy Womp will pick a random Womper to try and match, then try and pair with other Wompers by distance, if a compatible Womper is found within reasonable distance, Wompage will begin.\n&lt;&gt; If the player is in a solo wompening, Wompy Womp will try and pair with a nearby Womper by distance, if a compatible Womper is nearby then their desire to Womp will lead to 2 in the active Wompening.\n&lt;&gt; The player will only be considered for random Wompage if they have 200% Sex Heat or higher, or if they are alone in a Womp session.\n&lt;&gt; A simple Wompy Womp menu using UniPalUI to customize Womperific settings, does not save between sessions and will need to be customized upon restarts. (Intentional)\n[b]~-~ Requirements ~-~[/b]\n&lt;&gt; Project Sugar Cake 0.6DEV or newer ( [url=https://www.loverslab.com/files/file/33158-project-sugar-cake-scake-animation-and-stat-framework/]https://www.loverslab.com/files/file/33158-project-sugar-cake-scake-animation-and-stat-framework/[/url] )\n&lt;&gt; UniPalUI 0.1 DEV or newer ( [url=https://www.loverslab.com/files/file/37188-unipalui/]https://www.loverslab.com/files/file/37188-unipalui/[/url] )\n&lt;&gt; UE4SS for the current version of Palworld ( [url=https://github.com/UE4SS-RE/RE-UE4SS]https://github.com/UE4SS-RE/RE-UE4SS[/url] )\n[b]~-~ How to Install  ~-~[/b]\nAfter installing the requirements and downloading Wompy Womp - Random Sexy Edition, then unzip the archive and from inside the folder of your platform, copy the 'LogicMods' folder into \"[Palworld Install]/Pal/Content/Paks\" (The WompyWompRandomSexy.pak should be in the LogicMods folder)\n[b]~-~ Source Notes / Source Available ~-~[/b]\nWompy Womp's functionality will be put into the much more complex 'Palicious' gameplay module I've been working on in a more complete fashion. As such, there are currently no plans to expand on Wompy Womp's functionality, however if there are any updates it will be to the source provided for Wompy Womp. The goal of this small project was to provide a working example so other modders can get a sense of what a simple mode like this looks like and to act as a jump-off point for more advanced mods. The source (available on my SubscribeStar and through Discord) is the uncooked uasset files you can drop directly into your Unreal Engine Project's Content/Mods folder alongside the SCake SDK and UPI SDK (Both SDKs are required for the source to work, otherwise you'll be missing functions/assets). As of writing, the source lacks any serious comments or notes, however this could change in the future if enough requests for it happen. If you need help getting the source working or need help understanding it, please feel free to interact on our Discord! (The r18_Modding channel would be the best place to ask about it)\n[b]~-~ Source Usage Rights ~-~[/b]\nPlease do not re-distribute the source files and instead direct users who want/need the source files to the Discord. Do not redistribute Wompy Womp as your own creation, please give credit where credit is do. The source is provided as an example and as reference material, you are free to use segemnts of the code in your own projects but do not use the code in its entirety or large segements of the code where the code would be the majority of the mod's implementation and distribute the compiled mod without proper credit to Wompy Womp and its creation, Michael \"Spirit Shard\" Stanich. Do not use this source or any derivatives for profit or paywalled content in any way, shape, or form. This includes mods for purchase, 'paid mods', early access behind a paywall or closed community with a subscription, placing the mod behind any sort of subscription/interactive engagement/or otherwise limited access which requires investment from the user, or any other forms which could be considered a paywall by any reasonable person.\nFor your own safety, be extremely careful when sharing uncooked UE assets and source material as this could accidentally lead to leaking personal information or leave you vulnerable to doxing/attacks.\n[b]~-~ Want to make your own sexy gameplay mod with wompage? Consider joining the Discord, The Broken Chatbox! ( [url=https://discord.gg/h3vB7S4FEw]https://discord.gg/h3vB7S4FEw ) We'd be really happy to have you around and help you make your dream mod a reality! ~-~[/b]",
    "thumbnail": "https://michaelpstanich.com/asset/modhack/2024-10-19_Palworld_WompyWompRandomSexyEdition/cover.png"
  },
  "Sugar Cake Animation Framework": {
    "root": "E:\\SteamLibrary\\steamapps\\common\\Palworld\\Pal\\Content\\Paks,",
    "version": "v0.6.1 DEV",
    "file_id": "local",
    "file_name": "Sugar Cake Animation Framework v0.6.1 DEV.7z,",
    "entries": [
      "LogicMods/",
      "~Mods/",
      "~Mods\\AnimJSON/",
      "~Mods\\SaveJSON/",
      "~Mods\\AnimJSON\\_Animation_Config_Files_Go_Here.txt",
      "~Mods\\SaveJSON\\_Save_Persist_Files_Go_Here.txt",
      "LogicMods\\AC_AnimFramework.pak",
      "LogicMods\\AC_SugarCakeExtension.pak",
      "~Mods\\AnimJSON\\_LoadList.json",
      "~Mods\\AnimJSON\\_LoadList_Example.json"
    ],
    "local": true,
    "author": "Spirit_Shard",
    "description": "[url=https://www.loverslab.com/files/file/33158-sugar-cake-animation-framework-scake-animation-and-stat-framework/]https://www.loverslab.com/files/file/33158-sugar-cake-animation-framework-scake-animation-and-stat-framework/[/url]\n[b](_) Sugar Cake Animation Framework - Palworld Sex and Stats Framework (_)[/b]\nCreated and Maintained by : Michael \"Spirit Shard\" Stanich\nDiscord - The Broken Chatbox - [url=https://discord.gg/h3vB7S4FEw]https://discord.gg/h3vB7S4FEw[/url]\nWebsite - [url=https://www.michaelpstanich.com/]https://www.michaelpstanich.com/[/url]\nTBC Thread - [url=https://forum.thebrokenchatbox.com/d/26-project-sugar-cake-scake-palworld-mod]https://forum.thebrokenchatbox.com/d/26-project-sugar-cake-scake-palworld-mod[/url]\nv (Donations! =^-^=) v\nSubscribeStar - [url=https://subscribestar.adult/michaelpstanich]https://subscribestar.adult/michaelpstanich[/url]\n[img]https://www.loverslab.com/uploads/monthly_2025_04/SugarCake_BetaCover.png.a719bf27c59f6e4a655156fc8c534712.png[/img][/url]\n[b](_) What is Sugar Cake? (SCake for short) (_)[/b]\nSugar Cake Animation Framework is a sex animation and gameplay stats framework for Palworld focused on providing the baseline for adult content in Palworld. SCake allows animators to import their animations into Palworld, then animators and users can use those individual animations to create Animation Events (effectively entire scenes) for customized playback of complex animations. (More on this below) SCake also adds additional stat tracking to create dynamic stats that don't fit within the game's native structure (such as some naughty stats ^.-).\n[b]< - > Self Promotion < - >[/b]\nI'm never really great at asking for donations, but if you never mention it people may not even know about it! So here I am, letting you know I have a SubscribeStar! - [url=https://subscribestar.adult/michaelpstanich]https://subscribestar.adult/michaelpstanich[/url] (SCake is completely free with no paywalls, but Subscribers do get a special role on Discord and other benefits regarding other projects of mine!) If you can't help support the project financially, that's ok! I appreciate any little bit of help, whether that's just in giving feedback and bug reports, or by just sending a politely worded message!\n[b](_) Notice! (_)[/b]\nAll versions of Sugar Cake from 0.5 DEV forward will require UniPalUI! SCake uses UniPalUI for the UI and input handling, without it technically SCake can still play animations and function but you may lack any meaningful way to customize or trigger animations depending on your configuration, and you won't get the on-screen adjustment UI and customizations or FreeCam support... (Just get UniPalUI ^-^ - [url=https://www.michaelpstanich.com/?mode=modhack&amp;view=2024-10-16_Palworld_UniPalUI)]https://www.michaelpstanich.com/?mode=modhack&amp;view=2024-10-16_Palworld_UniPalUI)[/url]\nSugar Cake 0.6 DEV Changed the JSON Config format! Animation packs will need to update their packs with new JSON config files to function properly!\n[b](_) Known Critical Issues (_)[/b]\nTriggering animations isn't tested in every possible scenario, so if you start animations in weird conditions stuff may break! If you find something that breaks with anims, please report it so a work-around/fix/validation can be made for it!\n[b](_) Features List (_)[/b]\n[b] <> Custom Animation Player[/b]\n- - > A fully custom Animation Player built with erotic animations in mind. The system allows animators and scene creators to define stages with automatic climax and post climax support. Users get access to various advanced settings to customize their experience with SCake to their preference!\n[b] <> Custom JSON importer for Animations[/b]\n- - > Sugar Cake features a fully customizable and dynamic way to import animations through JSON files which both animators and users can fully customize in any plain text editor! Create either simple Animation Events with easy to understand data, or go full scene master with advanced settings and crazy potential! (You can even share your customized events by sharing your own JSON file with others, all without ever needing to animate!)\n[b] <> Integrations with UniPalUI for Custom UI, Input, and FreeCam[/b]\n- - > Uses UniPalUI to implement a simple to use user interface for customizing settings and adjusting animations while also using UniPalUI's input functions for easy debug controls and FreeCam during animations! Also comes with a set of custom UI elements specifically tailored for SCake and its functions!\n[b] <> Pal Stat Tracking[/b]\n- - > Tracking for custom stats that can be used either by animations or through external mods using the SCake SDK called modules! SCake handles the rising/lowering and tracking without requiring any input from the user!\n[b] <> Custom Sex Equips System for Genders[/b]\n- - > While Palworld may only have Male/Female internally, with SCake's additional tracking and systems we can register more! SCake features an SEquip tags systems where instead of being stuck to pre-defined genders, characters can have specific Sex Equipment defined on their character for compatibility checking!\n[b] <> Preference Settings[/b]\n- - > May not sound like a big deal at first, but let's say you're not into a specific kind of animation or combination? Instead of having to sift through all your animations and manually disable/remove them, instead you can change your preference settings to block certain anims from playback!\n[b] <> Full Persistence[/b]\n- - > SCake has its own save system for additional data unique to the mod! These saves are in .json format (so you can edit them externally) and save per-world save! You can also use \"Adjust Profiles\" to customize how characters position during animations, and \"Setting Profiles\" to customize settings, and since these save as a JSON file like other saved data, they persist and are share-able!\n[b] <> Oh, did I mention this is a Framework? We have an API and SDK![/b]\n- - > Provided along-side SCake is the SCake SDK as well as documentation on the various functions you can call within SCake. This allows you to create modules for SCake through Blueprints with all the powers UE5 provides! (May require a palworld modding kit set-up for proper use)\n[b](_) Inputs (_)[/b]\nSCake uses UniPalUI for input handling, so UniPalUI must be installed to use keybinds and the menu!\nWith the default bindings for UniPalUI v0.1DEV, use Shift+Y to open the menu and select \"Project Sugar Cake\" using the mouse to edit settings and preferences.\n(\"With Debug\" means \"Enable Debug Controls\" is enabled in settings, this is currently enabled by default until more gameplay mods are made)\n[b]Default Key Bindings...[/b]\n[b]Shift+Y[/b] : Open UniPalUI menu for setting/preference adjustments\n[b]Shift+K[/b] : View/control target's playing Animation Event\nHold Shift+K : View/Control summoned pal's playing Animation Event\n[b]R while viewing anim[/b] : Open Animation Adjust/Control Menu (Use Shift+K to start viewing a non-player involved anim)\n[b]J[/b] : Touch Self\n---\n[b]Debug Controls[/b]\n(Currently enabled by default)\n---\n[b]J with Debug[/b] : Select Self for Animation\n[b]Hold J with Debug[/b] : Touch Self\n[b]G with Debug[/b] : Select target for animation\n[b]Hold G with Debug[/b] : Select summoned pal for animation\n[b]H with Debug[/b] : Clear selected animation targets\n[b]Hold H with Debug[/b] : start animation with selected targets\n[b]Shift+[ with Debug[/b] : Increase Sex Heat of targets\n[b]Shift+] with Debug[/b] : Decrease Sex Heat of targets\n[b](_) How to install the SCake framework (_)[/b]\nNote : When SCake is installed and running, a notification will show up on the left part of the game screen, saying it's either installed (title screen) or running (in-game). Use this to determine if the mod has been installed correctly.\n- Download both Sugar Cake Animation Framework and UniPalUI, then unzip the archives and from inside the folder for your platform, copy LogicMods and ~mods folder into \"[Palworld Install]/Pal/Content/Paks\"\n- In the ~mods folder, enter the \"AnimJSON\" folder and run the \"__Create_Load_List__.bat\" file to auto-fill the load list (You'll need to run this any time you install new animation .json files)\n[ + If the .bat file fails to run or says \"Access Denied\" you can try moving the entire AnimJSON folder to your desktop, running the .bat file, then placing it back. Remember to check if it actually filled the _LoadList.json with the .json names. If it still failed you'll just have to enter in the .json file name for each animation pack you have installed manually into the _LoadList.json in JSON format (so like \"AnimPak1\",\"AnimPak2\",\"\",\"\" ect, use [url=https://jsoneditoronline.org/]https://jsoneditoronline.org/[/url] to help with formatting). ]\n- Install the proper version of UE4SS (Latest version with updated Palworld) - [url=https://github.com/UE4SS-RE/RE-UE4SS]https://github.com/UE4SS-RE/RE-UE4SS[/url]\n[ + Ensure inside the UE4SS install, inside the \"mods\" folder, open the \"mod.txt\" and make sure \"BPModLoaderMod\" is set to 1 ]\n[ + If your game starts crashing after installed UE4SS, open the UE4SS-settings.ini file that is within the UE4SS install and set \"bUseObjectArrayCache\" to false ]\n[Optional, sort of]\n- Must install animation packs (Detailed below)\n- Remember to run the \"__Create_Load_List__.bat\" file every time you install new animations with .json files! (If the .bat file doesn't run, you can enter the .json file names for animations you want to load in-game manually into the _LoadList.json file)\n[b](_) How to install animation packs (_)[/b]\n[b]~ For .json installs ~[/b]\n- Follow their provided instructions if they say where to install the .pak file, otherwise place this is in \"Pal/Content/Paks/~mods\"\n- Place the provided .json file in \"Pal/Content/Paks/~mods/AnimJSON/\" and run the \"__Create_Load_List__.bat\" in the same folder (if the .bat isn't working for you, you can enter in the names of the .json files manually instead, can also try moving the AnimJSON folder to the desktop before running the .bat then moving it back)\n- Now it should load in-game the next time .json animations are registered!\n[b](_) How to add and create animation packs (_)[/b]\nFor a full guide you can read it over on my website at [url=https://www.michaelpstanich.com/article/SCake_HowToMakeAnimsGuide.html]https://www.michaelpstanich.com/article/SCake_HowToMakeAnimsGuide.html or follow the links on our Discord!\nTo add more animations you just need to (correctly) import the animations into UE5.1 with the correct file path (Content/Mods/YourModName), convert the animation into an animation montage (right click the animation sequence and it will show up in that list), ensure you do what ever edits are required for your montage/animation to look and function correctly (Remember for looping animations to open your montage, go to the \"montage sections\" tab, and tickmark where it should loop! If you have no sections, just click the 'default' checkbox and it will loop the full animation.).\nOnce you have the animation montage you can export the .pak file and place it in ~mods, note the file-paths you had in UE5.1 as we'll need these to register the animation properly.\nOpen the appropriate templates provided in the AnimJSON folder from SCake and enter in the correct metadata for your animation, delete any sections/data you're not using for your animation. (Note: You can check the \"Sugar Cake - Metadata.txt\" provided with SCake for a description of the parameters, the \"_SCake_TemplateWithExplainations.json\" has sections explaining each parameter and may be a good place to start reading while using other .json files as a reference to create your own)\nWith your .json file complete, rename it to match your pack name and include it with your .pak when distributing your animation pack! I recommend testing the pack before distribution, so install it like any other pack by placing the .json file to the AnimJSON folder and adding the file name to the \"_loadlist.json\" file, then load up in-game and trigger the animations.\n[b](_) Permissions / Usage Rights (_)[/b]\n[b]These Permissions and Usage Rights apply to all content related to Sugar Cake Animation Framework, whether made by a first or third party.[/b]\n[b]All content must be provided free of charge, with no paywalls or exchange requirements[/b]\n- No paywalls, paid early access, subscription requirements, restricted access, premium versions, etc.\n- Does not apply to source files used in the creation process not required for full and expected functionality\n[b]Configuration/External files are freely available with no restrictions on edits or distribution[/b]\n- Everyone is allowed to discuss, customize/edit, share, distribute/re-distribute, re-use any and all configuration files provided by any mod or user\n- Everyone is allowed to reference any asset from any mod, package, or asset without restriction or retaliation\n- This also applies to any templates or files that interact with Sugar Cake Animation Framework provided by any mod or user\n- Applies regardless of format/extensions/method\n[b]Do not intentionally sabotage or perform malicious behavior[/b]\n- Do not intentionally cause a user's save to break, user's game to brick, crash, or other malicious actions\n- Do not intentionally cause another mod to stop functioning or overwrite their author information without permission\n- Do not include or hide content, without warning, which may be harmful\nAs a recommendation, [b]please clearly label your content with descriptive names, tags, and IDs while separating different fetish content into different configuration files.[/b] This will allow users to customize what they see and interact with during the installation process and [b]will prevent you from accidentally (or intentionally) hiding content which may cause psychological harm.[/b] Please be considerate of others in the community and how they may want to use your pack, not everyone will find a sudden surprise animation to be all that pleasant!\n[b](_) Questions and Answers (FAQ) (_)[/b]\n[b]Question :[/b] I installed everything and it doesn't work!\n[b]Answer :[/b] Install everything PROPERLY and it'll work! Read the install section carefully and follow things step by step, copying files isn't complicated! Also make sure you're not using Vortex mod manager, it can break your install and doesn't install mods like SCake properly!\n[b]Question :[/b] Does SCake work in Multiplayer?\n[b]Answer :[/b] Not yet, in a peer-to-peer game you can have the host start animations but no other player will see or be able to start animations. If you want to play multiplayer with SCake you'll have to wait for multiplayer to be properly supported! (join the discord and listen in for when we're doing multiplayer tests if you want to help out!)\n[b](_) Want to implement more animations? Feel free to contact me or interact with our Discord! We're a community thriving on creativity and would be really glad to help! (_)[/b]\n> - > - > - > - < - < - < - <\n[b]Some links to Animation Paks on LoversLab![/b] (These are some I know about, if more show up please let me know!)\n[b]Lemonlord's Animation Pack[/b]\n[url=https://www.loverslab.com/files/file/33582-lemonlord-animation-pack-for-scake-male-playerfemale-pal/]https://www.loverslab.com/files/file/33582-lemonlord-animation-pack-for-scake-male-playerfemale-pal/[/url]\n[b]Lurker's Animation Pack[/b]\n[url=https://www.loverslab.com/files/file/35484-scake-lurkers-animation-pack/]https://www.loverslab.com/files/file/35484-scake-lurkers-animation-pack/[/url]\n[b]TemTemLover's Animations[/b]\n[url=https://www.loverslab.com/files/file/33129-scake-pack-temtemlovers-animations/]https://www.loverslab.com/files/file/33129-scake-pack-temtemlovers-animations/[/url]\n[b]Spirit's SCake Animations[/b]\n[url=https://www.loverslab.com/files/file/34653-spirits-scake-animations/]https://www.loverslab.com/files/file/34653-spirits-scake-animations/[/url]\n[b]You can find more animations over on our Discord[/b] (There's a couple of in-progress animation packs, so they may not have been posted elsewhere yet!)[b] and more across LoversLab![/b]\n[b]Thank you everyone for being awesome and making great stuff! Hopefully more can join us in our creatively lewd adventure and make more awesome Palworld content![/b]",
    "thumbnail": "https://michaelpstanich.com/asset/modhack/2024-02-19_Palworld_ProjectSugarCake/cover.png"
  },
  "Palicious": {
    "root": "E:\\SteamLibrary\\steamapps\\common\\Palworld\\Pal\\Content\\Paks",
    "version": "v0.1 DEV",
    "file_id": "local",
    "file_name": "Palicious v0.1 DEV.7z",
    "entries": [
      "LogicMods/",
      "LogicMods\\Palicious.pak"
    ],
    "local": true,
    "author": "Spirit_Shard",
    "description": "[url=https://www.loverslab.com/files/file/41283-palicious-scake-gameplay-mod/]https://www.loverslab.com/files/file/41283-palicious-scake-gameplay-mod/[/url]\n[b]Palicious![/b]\n[b]Created and Maintained by : Michael \"Spirit Shard\" Stanich[/b]\n[b]Discord - The Broken Chatbox -[/b] [url=https://discord.gg/h3vB7S4FEw]https://discord.gg/h3vB7S4FEw[/url]\n[b]Website -[/b] [url=https://www.michaelpstanich.com/]https://www.michaelpstanich.com/[/url]\n[b]TBC Thread -[/b] [url=https://forum.thebrokenchatbox.com/d/32-palicious-palworld-mod]https://forum.thebrokenchatbox.com/d/32-palicious-palworld-mod[/url]\nv (Donations! =^-^=) v\n[b]SubscribeStar -[/b] [url=https://subscribestar.adult/michaelpstanich]https://subscribestar.adult/michaelpstanich[/url]\n[img]https://www.loverslab.com/uploads/monthly_2025_04/Palicious_Logo.png.0e9c32f06ce56fb1b27e6dc80da5461a.png[/img][/url]\n[b]What is Palicious?[/b]\nPalicious is a gameplay mod for Sugar Cake Animation Framework which adds various gameplay systems for either incentivizing or starting Erotic Animations. Palicious' goal is to provide a baseline for gameplay systems and expand over time, such as including EXP gain, Combat Submit, Lusting mechanics, ect. Every feature of Palicious is modular and can be enabled/disabled from within its UniPalUI Menu.\n[b]Self Promotion[/b]\nLike how Gorgeously Delicious Palicious looks? Maybe consider supporting my work? You can send donations through [url=https://subscribestar.adult/michaelpstanich]https://subscribestar.adult/michaelpstanich[/url] to help me develop these mods as well as the SCake framework itself! (All my game mods, including Palicious/SCake, are completely free with no paywalls, Subscribers do get a special role on Discord and some benefits related to other projects however!) If you can't support financially, then you can still support by giving feedback, making bug reports, or by just being awesome! Thank you for the consideration! =^-^=\n[b]Notice![/b]\nPalicious can give benefits and enable features which can have permanent affects to your game save! It's recommended you either back-up your save or play with Palicious in a separate world specifically for NSFW gameplay!\n[b]Feature List[/b]\n- Radiant EXP : Give EXP to characters for Erotic Animations\n- Combat Submission : Engage in sexual content during combat\n- Lusting Engagements : Enables autonomous erotic engagements\n[b]Requirements[/b]\n- Sugar Cake Animation Framework v0.6 DEV or above ( [url=https://michaelpstanich.com/?mode=modhack&amp;view=2024-02-19_Palworld_ProjectSugarCake]https://michaelpstanich.com/?mode=modhack&amp;view=2024-02-19_Palworld_ProjectSugarCake[/url] )\n- UniPalUI 0.1 DEV or above ( [url=https://michaelpstanich.com/?mode=modhack&amp;view=2024-10-16_Palworld_UniPalUI]https://michaelpstanich.com/?mode=modhack&amp;view=2024-10-16_Palworld_UniPalUI[/url] )\n- UE4SS for loading in the blueprints ( [url=https://github.com/UE4SS-RE/RE-UE4SS]https://github.com/UE4SS-RE/RE-UE4SS )\n[b]How to install Palicious[/b]\n- Install all requirements\n- Copy the LogicMods folder provided with Palicious into your Palworld install's Paks folder\n- If things are installed correctly, you'll see a notification show up through UniPalUI saying Palicious is running/installed!\n[b]Got ideas for Palicious? Let me know![/b]\nIf you've got some fun gameplay ideas, don't be afraid to share them! Palicious is a bit of an 'everything' gameplay mod, the idea is to add a bunch of smaller modular functions to cover as many bases as possible until more complex mods come around. That makes Palicious a good testing ground for various mechanics, and if you've got grander ideas, share those too so maybe another mod can be made!",
    "thumbnail": "https://michaelpstanich.com/asset/modhack/2025-04-20_Palworld_Palicious/cover.png"
  },
  "TemtemLover Animations": {
    "root": "E:\\SteamLibrary\\steamapps\\common\\Palworld\\Pal\\Content\\Paks\\~mods",
    "version": "v0.6",
    "file_id": "local",
    "file_name": "06TemtemAnimsApril25STEAM.zip",
    "entries": [
      "AnimJSON/",
      "AnimJSON\\TemtemDynamicPairings.json",
      "AnimJSON\\TemtemNewAnims.json",
      "AnimJSON\\TemtemOldAnims.json",
      "HighGuardAnims.pak",
      "TemTemAnims.pak"
    ],
    "local": true,
    "author": "TemtemLover",
    "description": "[url=https://www.loverslab.com/files/file/33129-scake-pack-temtemlovers-animations/]https://www.loverslab.com/files/file/33129-scake-pack-temtemlovers-animations/[/url]\nThis is an animation pack focused on providing minimal base compatibility for sex pairings between pals and humans.\nIt contains a dominant and submissive animation for each pal listed, and animations are generated for each possible match up.\n[u]Currently this animpack contains 5500~ combinations of animations spread between 60~ Pals[/u]\nDo note that these animations are more of a test ground for possibilities and figuring out kinks of both SCake and Palworld. They do not provide any gameplay, only on-demand debug animation play. They are relatively simple and not too polished, intended to cover as many pals as possible down the line to make most pairings work.\n===============================================================\n[b][u]SUPPORT[/u][/b]\nI opened up [url=https://www.patreon.com/TemtemLover]patreon[/url], if you like what I am doing - consider subscribing.\n===============================================================\n[b]List of pals: [/b]\n[spoiler]\nHuman, Direwolf, Foxsparks,\nDaedream, Eikthyrdeer, Melpaca,\nKatress, Cremis, Chillet, Galeclaw,\nCattiva, Dinossom, Anubis, Lovander,\n=======================\nBeegarde, Cinnamoth, Elizabee, Foxicle, Incineram, Killamari, Tombat\n=======================10/9/24\nQuivern, Nox\n=======================7/10/24\nDepresso, Kitsun, Shadowbeak, Wixen\n======================= 8/10/24\nPetalia, Lyleen, Dazemu, Maraith, Loupmoon\n======================= 9/6/24\nReindrix, Bushy, Fenglope, Orserk\n======================= 10/4/24\nVixy, Azurobe, Jetragon, Pyrin\n=======================11/18/24\nCryolinx, Fuddler, Gobfin, Kelple, Relaxaurus, Suzakku, Vanwyrm.\n=======================2/25/25\nSmokie, Silvegis, Tarantriss, Roobi, Lunaris, Vaelet\n[b]List of pals-specific animations:[/b]\nDaedream (Dream animations), Lovander Missionary, Foxpark (stroking and fingering), Direhowlx2 splitroast, Lamball/Chikipi \"carry\", Shadow-beak-job, Depresso lazi fuck, Kitsun bending.\nDazemu(M) AutoFellatio, Petalia(F) Oral, Maraith(M) Bind, Reindrix-deer-Fenglope Mare Style, Daedream/Flopie FaceFuck-PussyLick-CarryFuck, Orserk standing 69,\nCryolinx(M) - Human(any) Fleshlight\nSuzaku(F) - Air Embrace with M Human\nTombat(M) - Levitation Tricks with (any) Human\nPaladius/Necromus(Any, 2 variations) - Getting Mounted by (M) Human\nIncineram (Any, 2 variations) - Getting wall banged by (M) Human\nIncineram (M) - Mastrubration with 2 stages\n[/spoiler]\n[url=https://www.loverslab.com/files/file/33790-models-nsfw-community-mesh-pack-for-scake-animations/]https://www.loverslab.com/files/file/33790-models-nsfw-community-mesh-pack-for-scake-animations/[/url]\n[url=https://www.loverslab.com/files/file/35941-altermatic-unfairjackal-pals-mostly-anatomically-correct-128163-and-counting-male-female-some-futa/]https://www.loverslab.com/files/file/35941-altermatic-unfairjackal-pals-mostly-anatomically-correct-128163-and-counting-male-female-some-futa/[/url]\n[b]IMPORTANT![/b]\nThe NSFW Community meshpack AND Unfairjackal model pack (above) is highly recommended for these animations!\nIf you want [b]sounds [/b]in the animations - install this\n[url=https://www.loverslab.com/files/file/40109-sounds-palsoundbank-mod-resources-for-modders-for-animation-montages/]https://www.loverslab.com/files/file/40109-sounds-palsoundbank-mod-resources-for-modders-for-animation-montages/[/url]\n[b]Installation:[/b]\n[spoiler]\n- [b]MUST [/b]Install [url=https://www.loverslab.com/files/file/33158-project-sugar-cake-animation-and-stat-framework/]SCake[/url] as an animation framework and its dependancies, it is first step before next two ways of continuing:\n- (Optional) install NSFW Community Meshpack\n- Download and extract the zip file into[i] `Palworld\\Pal\\Content\\Paks\\~mods\\`[/i]\n- Make sure the .pak file is within ~mods folder, and AnimJSON folders got merged.\n- Open AnimJSON folder and launch __Create_Load_List__.bat\n- If you are getting access error - launch the bat file with admin rights OR change the game location to not admin folder OR open _LoadList.json and manually add all json names you downloaded.\n[spoiler]\n{\n  \"LoadList\": [\n    \"TemtemAnimsPairings\",\n    \"TemtemAnimsDireWoof\",\n    \"BanimMod\"\n  ]\n}\n[/spoiler]\nLike this.\nThat's all. Now any of mentioned pals should have one doggy style animations in any pair.\n[/spoiler]\nIf you get any issues, post them here.\n[s]Personal recommendation is also [url=https://www.nexusmods.com/palworld/mods/440]photo mod[/url], as player animations don't give you control of the camera.[/s]\nLess relevant due to latest release of Scake having camera controls.\n[b]**Known issues I'll mention instantly**[/b]:\n[spoiler]\n- There are some clipping issues. This is attempted to drive to minimum, but just due to amount of possibilities is impossible. (Aside from direwolf and eagle and dino animations, their genitalia will be adjusted later)\n- BOSS and Lucky pals are eligiable for animation. This however isn't intended to work, you will have to align stuff manually (which still wont do it well). This is done in case you use OK material variants - those remove scaling from lucky pals, making them viable for animation\n- Deer variations are not implemented yet, as SCake will patch to do it automatically later.\n[/spoiler]\n[b]READ THIS FAQ BEFORE ASKING FOR HELP[/b]\n[spoiler]\n[b]Q: My game crashes when I load save![/b]\nA: Check your UE4SS settings (UE4SS-settings.ini where you installed UE4SS) and disable \"bUseObjectArrayCache\" by setting it to=false. Like\n[i]bUseObjectArrayCache=false[/i]\n[b]Q: I installed everything but it doesnt work![/b]\nA: Check the images posted in forum to make sure you put stuff in correct places. You need  Project Sugar Cake Dev - that's the actual framework. ScakeBasicAnim is a test animation with one solo female player currently. The SDK is for modders and you do not need it.\n[b]Q: I launch the game and nothing happened![/b]\nA: Install UE4SS. Check that you've put it to correct win64 folder. Check that you put [i]ProjectSugarCake.pak[/i] to correct folder.\n[b]Q: There are 0 animations, or there's json error![/b]\nA: Check [i]Pal\\Content\\Paks\\~mods\\AnimJSON[/i] _loadlist.json. Does it have jsons you downloaded and placed in same folder? Run .bat file if not. Check that you have the animation packs .paks installed aswell.\n[b]Q: How do I play animations??[/b]\nA: Right now they are only launched manually. See SCake control manual. Buttons are J K L U I O\n[b]Q: Failed to open descriptor file pal.uproject??[/b]\nA: Good job, you deleted or moved pal.pak (main game content file) somewhere else. Find it and put it back to pak folder, or verify game files.\n[/spoiler]\nBig thanks to @Spirit_Shard and @bokonus  for putting up with me as I was figuring it all out! And Boko especially for providing rigs for pals!\n[b]If you wish to try creating animations yourself [/b]- do try it out. It is as easy as it gets right now as community is making proxy rigs with IKs, making animation process a breeze. If you have any questions about it - visit discord is SCake topic! If you want to contribute to this animation pack - feel free to. I can  send you the blend files so you can align animations! (Or just unpack the .paks.. doesn't matter too much)\n===============================================================\nIf you have any specific pals in mind that you want to be added next - let me know in forum here! Do know that this set of animatons is strictly for basic doggy style pairings, not any fancy ideas as of now.",
    "thumbnail": "https://i.imgur.com/JeciiVk.gif"
  },
  "Lurker's Animation Pak - Pal x Human Series": {
    "root": "E:\\SteamLibrary\\steamapps\\common\\Palworld\\Pal\\Content\\Paks\\~mods",
    "version": "v1.3.2",
    "file_id": "local",
    "file_name": "LurkersAnimPak - Pal x Human Series - v1.3.2 (Steam).zip",
    "entries": [
      "AnimJSON/",
      "AnimJSON\\LurkersAnimPak.json",
      "LurkersAnimPak.pak"
    ],
    "local": true,
    "author": "Shade115",
    "description": "[url=https://www.loverslab.com/files/file/35484-scake-lurkers-animation-pack/]https://www.loverslab.com/files/file/35484-scake-lurkers-animation-pack/[/url]\nThis is an Animation Package for Palworld's \"SCake\" mod, as such, it requires SCake and its requirements.\nLink: [url=https://www.loverslab.com/files/file/33158-project-sugar-cake-scake-animation-and-stat-framework/]https://www.loverslab.com/files/file/33158-project-sugar-cake-scake-animation-and-stat-framework/[/url]\n\nWith update 1.3, this animation pack now has SFX using PalSoundBank as a resource. Therefore, it now requires it.\nLink: [url=https://www.loverslab.com/files/file/40109-sounds-palsoundbank-mod-resources-for-modders-for-animation-montages/][Sounds] PalSoundBank - Mod + Resources for modders for animation montages. - Palworld - LoversLab[/url]\n\nInstallation:\nMake sure you properly have SCake and its requirements installed.\nAdditionally, should you want sounds during animations, make sure to install PalSoundBank.\n\nYou will want to make sure to use the correct version of the mod, relative to the launcher you use. If things aren't working, you may be using the wrong version of the mod.\n\"LurkersAnimPak.pak\" and \"LurkersAnimPak-Pals.pak\" should be located in your Palworld/Pal/Content/Paks/~mods folder.\n\"LurkersAnimPak.json\" and \"LurkersAnimPak - Pal Series.json\" should be located in your Palworld/Pal/Content/Paks/~mods/AnimJSON folder.\n\nDon't forget to make sure \"LurkersAnimPak\" is added to your \"_LoadList.json\", which should be located in the above AnimJson folder. You can either add it manually, or run the \"__Create_Load_List__.bat\".\nShould the bat fail to generate your Load List properly, then you may want to temporarily move your \"AnimJSON\" folder to another location (such as the Desktop), and run the bat from there.\nIf you do so, make sure to move your \"AnimJSON\" folder back to its appropriate folder before you forget.\n\n\nCurrent Animation List as of 1.3:\n\nPal x Human\n[spoiler]\nAzurobe (F) / Human (M)\nUnivolt (M) / Human (F/M) (Climax)\nOrserk (F/M) / Human (M) (Climax)\nVerdash (F/M) / Human (M) (Leadin/Climax)\nLunaris (F) / Human (M) (Leadin/Climax)\nKelpsea (F) / Human (M)\nVixy (F) / Human (M) (Leadin/Climax)\nBroncherry (F) / Human (M)\nSibelyx (F/M) / Human (M)\nOrserk (M) / Human (F/M)\nCaprity (M) / Human (F/M) (Climax)\nPyrin (M) / Human (F/M) (Leadin/Climax)\nFoxparks (M) / Human (F/M) (Leadin/Climax)\nFelbat (F) / Human (M) (Leadin)\nAstegon (F) / Human (M)\nFoxcicle (F) / Human (M)\nPyrin (F) / Human (M)\nMenasting (M) / Human (F)\nFlopie (F) / Human (M) (Leadin/Loop/Interlude/Loop/Climax)\nDinossom (F) / Human (M) (Leadin/Climax)\n[/spoiler]\n\nPal x Pal\n[spoiler]\nDirehowl (M) / Flopie (F/M)\nGaleclaw (M) / Flopie (F/M)\nGaleclaw (F) / Flopie (M)\n[/spoiler]",
    "thumbnail": "https://static.loverslab.com/screenshots/monthly_2024_09/Buried.jpg.49b6887e30a01a4a1ee2b0f51d00f8db.jpg"
  },
  "Lurker's Animation Pak - Pal x Pal Series": {
    "root": "E:\\SteamLibrary\\steamapps\\common\\Palworld\\Pal\\Content\\Paks\\~mods",
    "version": "v1.3.2",
    "file_id": "local",
    "file_name": "LurkersAnimPak - Pal x Pal Series - v1.3.2 (Steam).zip",
    "entries": [
      "AnimJSON/",
      "AnimJSON\\LurkersAnimPak - Pals Series.json",
      "LurkersAnimPak-Pals.pak"
    ],
    "local": true,
    "author": "Shade115",
    "description": "[url=https://www.loverslab.com/files/file/35484-scake-lurkers-animation-pack/]https://www.loverslab.com/files/file/35484-scake-lurkers-animation-pack/[/url]\nThis is an Animation Package for Palworld's \"SCake\" mod, as such, it requires SCake and its requirements.\nLink: [url=https://www.loverslab.com/files/file/33158-project-sugar-cake-scake-animation-and-stat-framework/]https://www.loverslab.com/files/file/33158-project-sugar-cake-scake-animation-and-stat-framework/[/url]\n\nWith update 1.3, this animation pack now has SFX using PalSoundBank as a resource. Therefore, it now requires it.\nLink: [url=https://www.loverslab.com/files/file/40109-sounds-palsoundbank-mod-resources-for-modders-for-animation-montages/][Sounds] PalSoundBank - Mod + Resources for modders for animation montages. - Palworld - LoversLab[/url]\n\nInstallation:\nMake sure you properly have SCake and its requirements installed.\nAdditionally, should you want sounds during animations, make sure to install PalSoundBank.\n\nYou will want to make sure to use the correct version of the mod, relative to the launcher you use. If things aren't working, you may be using the wrong version of the mod.\n\"LurkersAnimPak.pak\" and \"LurkersAnimPak-Pals.pak\" should be located in your Palworld/Pal/Content/Paks/~mods folder.\n\"LurkersAnimPak.json\" and \"LurkersAnimPak - Pal Series.json\" should be located in your Palworld/Pal/Content/Paks/~mods/AnimJSON folder.\n\nDon't forget to make sure \"LurkersAnimPak\" is added to your \"_LoadList.json\", which should be located in the above AnimJson folder. You can either add it manually, or run the \"__Create_Load_List__.bat\".\nShould the bat fail to generate your Load List properly, then you may want to temporarily move your \"AnimJSON\" folder to another location (such as the Desktop), and run the bat from there.\nIf you do so, make sure to move your \"AnimJSON\" folder back to its appropriate folder before you forget.\n\n\nCurrent Animation List as of 1.3:\n\nPal x Human\n[spoiler]\nAzurobe (F) / Human (M)\nUnivolt (M) / Human (F/M) (Climax)\nOrserk (F/M) / Human (M) (Climax)\nVerdash (F/M) / Human (M) (Leadin/Climax)\nLunaris (F) / Human (M) (Leadin/Climax)\nKelpsea (F) / Human (M)\nVixy (F) / Human (M) (Leadin/Climax)\nBroncherry (F) / Human (M)\nSibelyx (F/M) / Human (M)\nOrserk (M) / Human (F/M)\nCaprity (M) / Human (F/M) (Climax)\nPyrin (M) / Human (F/M) (Leadin/Climax)\nFoxparks (M) / Human (F/M) (Leadin/Climax)\nFelbat (F) / Human (M) (Leadin)\nAstegon (F) / Human (M)\nFoxcicle (F) / Human (M)\nPyrin (F) / Human (M)\nMenasting (M) / Human (F)\nFlopie (F) / Human (M) (Leadin/Loop/Interlude/Loop/Climax)\nDinossom (F) / Human (M) (Leadin/Climax)\n[/spoiler]\n\nPal x Pal\n[spoiler]\nDirehowl (M) / Flopie (F/M)\nGaleclaw (M) / Flopie (F/M)\nGaleclaw (F) / Flopie (M)\n[/spoiler]",
    "thumbnail": "https://static.loverslab.com/screenshots/monthly_2024_09/Facefucker.jpg.848a35bc809802cfbe8e8cb0732adbf0.jpg"
  },
  "Spirit's SCake Animations": {
    "root": "E:\\SteamLibrary\\steamapps\\common\\Palworld\\Pal\\Content\\Paks\\~mods",
    "version": "v0.1.2",
    "file_id": "local",
    "file_name": "SpiritsNaughtyAnimsPack 0.1.2.7z",
    "entries": [
      "AnimJSON/",
      "AnimJSON\\SpiritsNaughtyHumanAnims.json",
      "SpiritsNaughtyHumanAnims.pak"
    ],
    "local": true,
    "author": "Shade115",
    "description": "[url=https://www.loverslab.com/files/file/34653-spirits-scake-animations/]https://www.loverslab.com/files/file/34653-spirits-scake-animations/[/url]\n[b](_) Spirit's Anims Packs (_)[/b]\nCreated and Maintained by : Michael \"Spirit Shard\" Stanich\nDiscord - The Broken Chatbox - [url=https://discord.gg/h3vB7S4FEw]https://discord.gg/h3vB7S4FEw[/url]\nWebsite - [url=https://www.michaelpstanich.com/]https://www.michaelpstanich.com/[/url]\nTBC Thread - [url=https://forum.thebrokenchatbox.com/d/27-spirits-naughty-anims-palworld-mod]https://forum.thebrokenchatbox.com/d/27-spirits-naughty-anims-palworld-mod[/url]\n[b]v (Donations! =^-^=) v[/b]\nSubscribeStar - [url=https://subscribestar.adult/michaelpstanich]https://subscribestar.adult/michaelpstanich[/url]\nI've got my own Animation Packs for the Project Sugar Cake (SCake) Stat and Animation Framework!\nUnfortunately, at the time of writing, I wasn't really ready to release these packs so for now I'm just releasing the Human only pack with the SCake_BasicsAnimPak Solo Female animation repackaged to work with the current version of Palworld and with updated information/JSON config.\nI plan to release 3 animation packs whenever I get time to finish up more anims (and I may release them more quickly now that I've started X.x), 2 naughty packs with erotic anims for Human only and then a pack including Pals as well, then 1 Non-Erotic pack with example animations for not-naughty use cases when modules start developing better.\nEach Erotic Animation Event will have at least 2 stages and climax variants with a few here and there getting more complicated to help show off SCake's capabilities. Keep in mind I'm a bit slow at 3D animation so I'll most likely take a good number of shortcuts at first but I'm not afraid to go back and update anims if they're not up-to-par!\nIf you have suggestions for animations you'd like to see, make sure to let me know!\n(_) Included Animations (_)\nNaughty Human Anims\nFemale Solo\n- (Old) Standing Self Gratification [Standing Masterbation]\n(_) How to install (_)\n- If SCake is not already installed, install the framework first! ( [url=https://www.loverslab.com/files/file/33158-project-sugar-cake-scake-animation-and-stat-framework/]https://www.loverslab.com/files/file/33158-project-sugar-cake-scake-animation-and-stat-framework/[/url] or [url=https://discord.gg/h3vB7S4FEw]https://discord.gg/h3vB7S4FEw[/url] )\n- Unzip the archive and place the ~mods folder in \"Pal\\Content\\Paks\"\n- Inside \"Pal\\Content\\Paks\\~mods\\AnimJSON\" folder, either run the create load list bat file included with SCake, or add the .json file names to the \"_LoadList.json\" manually\n(_) Other Information (_)\nFeel free to copy/edit the json file or reference these animations in your own animation events!",
    "thumbnail": "https://michaelpstanich.com/asset/modhack/2024-06-27_Palworld_SpiritsNaughtyAnims/cover.png"
  },
  "PalSoundBank - Mod + Resources for modders for animation montages.": {
    "root": "E:\\SteamLibrary\\steamapps\\common\\Palworld\\Pal\\Content\\Paks\\~mods",
    "version": "v6",
    "file_id": "local",
    "file_name": "PalSoundBankv6STEAM.zip",
    "entries": [
      "PalSoundBank.pak",
      "Z3NSoundPack.pak"
    ],
    "local": true,
    "author": "TemtemLover",
    "description": "[https://www.loverslab.com/files/file/40109-sounds-palsoundbank-mod-resources-for-modders-for-animation-montages/](https://www.loverslab.com/files/file/40109-sounds-palsoundbank-mod-resources-for-modders-for-animation-montages/)\n**This is a collab page by me, [@xMenar\\_](https://www.loverslab.com/profile/11090591-xmenar_/) and [@Z3N-DrAGON](https://www.loverslab.com/profile/12679134-z3n-dragon/) for keeping PalSoundBank and general NSFW sounds updated for public.**\n\n**Currently contains 112 pals - the list will grow with each update.**\n\nAll pals are present!\n\n**What does it do?**\n\nThe bank is an assortment of sound effects extracted from the game and reimported into a pak format. Modders (Animation Makers) will be easily able to access whole bank of in game sounds they might need (Currently the pack focuses on bringing all pal noises + imported some lewd sound effects that most will probably find useful)\n\nThis is primarily intended to use inside animation montages for creating Sugar Cake animations.\n\n**NOTE THAT THIS DOES NOT DO ANYTHING BY ITSELF, AND INSTEAD A BANK TO BE UTILIZED BY CREATORS.**\n\n**Why not just let modders include stuff manually? Why is it not referencing in-game assets?**\n\n> Going a bit more technical here.\n>\n> While it is possible to refer to in-game sounds - they are encoded by wwise, they are unnamed in a random order in a single folder of 2000 sound files. Sure, you could dig up datatables, but this package aims to easen the process for people who just want to do stuff. (Maybe one day someone will create an api to automatically retrieve the requested sound per each pal, but for now manual labor will do).\n>\n> However, if everyone would just package the sounds back into the game all the time - that will cause a bloat, as multiple animators will be packaging same things over and over and over. For this reason this bank is being created, to minimize the bloat. Artists are still free to bring their own sounds into their .paks - but they will have access to generic things, like slaps, suckles and pal noises. The bank is already 100mb. Imagine if each animator would import the entire bank for themselves and then package it. Now each animator have additional 100mb bloat that will load into the game, even though that bloat is exactly the same content.\n>\n> The positive side - if there are any updates that changes things - this will remain sturdy and in worst case easy to update. As other mods will refer to these assets, the assets will be kept alive, updated and improved, without having everyone to update their own mods all the time.\n\n**Usage:**\n\n**For Users:**\n\n> Hide contents\n> \\* Install UE4SS (You MOST likely already have it, if you intend to use SCake)\n> \\* Download the relevant file (STEAM or MICROSOFT, depending on platform)\n> \\* Extract to **Palworld\\Pal\\Content\\Paks\\**\n> \\* Make sure the SoundBank pak files are inside the **~Mods** folder\n>\n> That's it.\n\n**For Modders:**\n\n> This mini guide will cover things one after another, diving into deeper details and giving optional info when mentioned. \n>\n> **The essentials:**\n>\n> Download the modders package and extract it to your UE5 animation project into **\\Content\\Mods**\n>\n> [![Hbw1xsP.png](https://i.imgur.com/Hbw1xsP.png)](https://i.imgur.com/Hbw1xsP.png \"Enlarge image\")\n>\n> **Make sure** the resulting folder structure looks like this, it is important for the references locations to be exactly the same.\n>\n> Great!\n> Note that there is SoundBank\\_PrimaryAssetLabel in the PalSoundBank. Its ID is 225 - so please make sure your own animations are NOT exported in pak 225.\n>\n> Now off to good stuff\n> Open up an animation montage you wish to add sounds on.\n>\n> On the Notif track in the timeline right click - and add \"PlaySound\" notif.\n>\n> > [![0mE16xg.png](https://i.imgur.com/0mE16xg.png)](https://i.imgur.com/0mE16xg.png \"Enlarge image\")\n>\n> Select the new notif an look at Details tab - there are a few settings we are interested in.\n>\n> **Sound**\n> In here we select our SoundCue. Please choose \\*ONLY\\* a sound cue and not a raw sound. Raw sound does not have attenuation settings, it will sound like a static mono sound blasted directly into your ear.\n> In this example we select DirehowlDoggyCue.\n>\n> To explain - the \"PalDoggyCue\" are a set of premade sound Cues that fire a random relevant pal noise, applying a small modulator filter on top (pitch + volume). Making sound cues will be explained futher down, but for most tasks this will be enough, as you probably just want your pal to make a noise.\n>\n> **Follow**\n> Set this on and in the Attach Name section select related bone you want the sound to be from. In this case Head makes most sense.\n>\n> **Notify Trigger Chance**\n> Set this value between 0 and 1. This will make sound only trigger with a chance. In our case - 35%. If your animation is a loop of 30 frames, you probably want a value of around 0.2-0.3 to avoid pals flooding with noises. Otherwise if you have a long animation where you always want the sound to be played - leave it at 1.\n>\n> > [![AYHJaOy.png](https://i.imgur.com/AYHJaOy.png)](https://i.imgur.com/AYHJaOy.png \"Enlarge image\")\n>\n> That's it for essentials!\n> Export your animation **\\*as normal\\*** \\- do not include any extra files to your upload files. The reference will look for the bank installation on user side - given they have it - and find the sounds to play.\n>\n> **I want my own soundcues!**\n>\n> > Okay so maybe you don't want a random pal noise, or you want your own sound file to be imported. Let us get to that.\n> >\n> > In **PalSoundBank/Ques** there is a SoundCue named **DefaultCueCopyThis**\n> > You can copy it and then rename it, if you don't want to start from scratch.\n> >\n> > But we will start from scratch to understand what is going on!\n> >\n> > Create a new Sound Cue file (right click in content browser, write Sound Cue - press on Sound Cue.\n> > Open it up!\n> >\n> > At first it will look pretty empty with only the Output as the final nose.\n> > First things first - we need to apply attenuation setting. This is what causes the sound to not be mono and instead be spatial within the world.\n> > On the the left side you can find attenuation tab, in which you can select the setting.\n> > There is one already provided in the bank, and you ought to be using it unless you know why you want your own settings.\n> >\n> > [![Af3o5wM.png](https://i.imgur.com/Af3o5wM.png)](https://i.imgur.com/Af3o5wM.png \"Enlarge image\")\n> >\n> > Off to main page!\n> >\n> > The main things you are probably interested in would be Random and Modulator.\n> > Right click on empty field and search for Random, add it. Same for Modulator.\n> >\n> > Now find any sounds you want to use - drag and drop them into the SoundCue field. For example Cattiva01 and 02 found in Sounds/PalSounds/Cattiva. Custom sounds will have to be imported with wav format!\n> >\n> > Connect the cattiva outputs into the Random slots. Remove extra random slots by rightclicking on the empty circle and clicking delete input. It is **important as leaving extra empty nodes means they will be selected by random chance and sound will not happen.**\n> >\n> > If you click on Random node, you'll be able to see its settings. You may want to tune the \"weights\" of the random chance to your own likings, if you so desire. (The higher the weight value, more chance that specific slot will fire)\n> > Connect the random nose to Modulator. Inside the modulator you may tune pitch and volume min max. Pitch at 0.9 to 1.1 is good enough.\n> >\n> > Connect the Modulator to the Output and you'll end up with something like this\n> >\n> > > [![hjysfV0.png](https://i.imgur.com/hjysfV0.png)](https://i.imgur.com/hjysfV0.png \"Enlarge image\")\n> >\n> > There!\n> > Now make sure that cue is inside your own mod folder - DO NOT CHANGE EXISTING BANK CUES OR SWAP THEM. You have to export your own cues for them to work.\n>\n> **What do with AttenuationSettings?**\n>\n> > Preferrably nothing. If there will be better options - the modpack will be updated to just change existing one - all other mods that keep referring to this bank setting, will automatically be using updated variant.\n> >\n> >\n> >\n> > Create your own setting at your own will and measure.\n\n**Credits!**\n\n**[@TemtemLover](https://www.loverslab.com/profile/784284-temtemlover/) -** .Pak assembler and distributor\n\n**[@xMenar\\_](https://www.loverslab.com/profile/11090591-xmenar_/)** - Exporting the sound files and assembly of assets.\n\n[@Z3N-DrAGON](https://www.loverslab.com/profile/12679134-z3n-dragon/) - Additional NSFW sounds and cues contributor.\n\n[@LanzAnimationPak](https://www.loverslab.com/profile/11969091-lanzanimationpak/) and [@T-Box](https://www.loverslab.com/profile/154980-t-box/) - Initial tech elaboration and guidance\n\n[Assets from Lewd sound package from SFMLAB was used as well.](https://sfmlab.com/project/25318b99-9c84-4fc6-9236-74960b7ab830/)\n\n[OpenNSFW sounds are also used](https://opennsfw.carrd.co/)",
    "thumbnail": "https://i.imgur.com/HMVF0pe.png"
  },
  "INDY Simple SCake Consequences": {
    "root": "E:\\SteamLibrary\\steamapps\\common\\Palworld\\Pal\\Content\\Paks",
    "version": "v1.3",
    "file_id": "local",
    "file_name": "ASD_indy_SimpleSCakeConsequences-1.3.7z",
    "entries": [
      "ASD_indy_SimpleSCakeConsequences.pak"
    ],
    "local": true,
    "author": "alphabetsoupdog1234",
    "description": "[https://www.loverslab.com/files/file/40210-indy-simple-scake-consequences/](https://www.loverslab.com/files/file/40210-indy-simple-scake-consequences/)\nSimple SCake Consequences is a submod for \"I'm Not Dead Yet\" (INDY) that (when called) triggers a basic scene between the player and the character that defeated them.\nIt \\*absolutely requires\\* that I'm Not Dead Yet be installed. If this submod is installed without the main mod, Palworld \\*will\\* crash before reaching the main menu.\n\n\\---\n\n__What is \"I'm Not Dead Yet\" / INDY?__\nPlayer Defeat mod that can have numerous registered submods under it.\nIt will prevent the player from being killed / respawning and instead trigger one of the submods installed.\nIt's still WIP. Currently, the focus on next updates is just implementing player customization of things: setting individual submod weights, HP threshold, delay before it can be triggered again, etc. (and fixing any reported bugs)\nIt's fully functional as is, though.\n\n\\---\n\nDownloadable .7z file contains the \\*full\\* path for both Gamepass and Steam versions of the mod. If you use the Steam files for a Gamepass version of Palworld, it won't work. Same the other way.\nIf you want to just extract the mod files themselves, the .pak (& .utoc & .ucas for Gamepass) should be placed in the LogicMods folder in your Palworld install.\n\n__**How to use:**__\nAfter installing the mod and its requirements... __**MAKE SURE YOU HAVE ALL OF THE REQUIREMENTS INSTALLED CORRECTLY**__\nGet beat up?\n\n__**How to uninstall:**__\nNothing is saved persistently between sessions.\nJust delete the .pak (& .utoc & .ucas for Gamepass) and it's gone completely.\n\n# __Requirements:__\nUE4SS ([https://github.com/UE4SS-RE/RE-UE4SS](https://github.com/UE4SS-RE/RE-UE4SS)) -- at least version 3.0.1 works, untested with experimental\nUniPalUI ([https://www.nexusmods.com/palworld/mods/1894](https://www.nexusmods.com/palworld/mods/1894)) Dev version 0.1 (on loading game, it'll say v1000 in top left in blue)\nProject Sugar Cake ([https://www.loverslab.com/files/file/33158-project-sugar-cake-scake-animation-and-stat-framework/](https://www.loverslab.com/files/file/33158-project-sugar-cake-scake-animation-and-stat-framework/))\nI'm Not Dead Yet ([https://www.nexusmods.com/palworld/mods/2266](https://www.nexusmods.com/palworld/mods/2266)) -- newest version is best, anything before 1.0.2 will not properly randomize which submod is selected",
    "thumbnail": "https://static.loverslab.com/screenshots/monthly_2025_03/ASD_indysubmod_SCake_Consequences.png.706ea66391ab2e03b9717529c819563f.png"
  },
  "Z3N-Dr4GON's Animations": {
    "root": "E:\\SteamLibrary\\steamapps\\common\\Palworld\\Pal\\Content\\Paks\\~mods",
    "version": "v1.3.3",
    "file_id": "local",
    "file_name": "Z3N-Dr4GON's Animation Pack v1.3.3.zip",
    "entries": [
      "AnimJSON/",
      "AnimJSON\\Z3N_Anim_Pack_Multi.json",
      "AnimJSON\\Z3N_Anim_Pack_PalXPlayer.json",
      "Z3N_Anim_Pack.pak",
      "Z3N_Anim_PackNew.pak"
    ],
    "local": true,
    "author": "Z3N-DrAGON",
    "description": "[https://www.loverslab.com/files/file/41873-z3n-dr4gons-animations/](https://www.loverslab.com/files/file/41873-z3n-dr4gons-animations/)\nAnimation pack for Plaworld.\nContains NSFW!\nI will focus on Pal X Player animations but will include some Pal X Pal stuff down the line.\nWhat to expect: Most standard stuff/fetishes both under passionate and “rough-play” conditions.\nInstallation instruction inside the .zip file.\nAnimations:\n[spoiler]\n-Designation: UJP=UnfairJackPal mesh, BV=BakkasVSkin mesh, CMP=Community Mesh Pack mesh\n-Pal X Player\nXenovaderFromBelow_UJP [M Pal X Player]\nSilvegisFullService_UJP [M Pal X M Player]\nBlazamutRiding_UJP [M Pal X F Player]\nHelzephyrLove_UJP [F Pal X M Player]\nRayhoundDoggyKnot_BV [M Pal X F Player]\n-MultiActor\nBlazamutWindowThreesome_UJP [M Silvegis X F Blazamut X M Player]. Requires a window (any type - glass recommended) as object!\n[/spoiler]\nRequirments:\n[spoiler]\nUniPlaUI,\nSugar Cake Animation Framwork (SCake) [VERSION 0.6 or newer required]\nAltermatic Runtime Replacer\nUnfairJackalPals\nBakkasVskin pack which you can find here (Right now only the Rayhound animation uses it for anus movement, but more animations will use it in the future)\n(Optional if you want sounds)\nPal Sound Bank\n[url=https://www.loverslab.com/files/file/40109-sounds-palsoundbank-mod-resources-for-modders-for-animation-montages/]https://www.loverslab.com/files/file/40109-sounds-palsoundbank-mod-resources-for-modders-for-animation-montages/[/url]\nSexy Mozzarina (By T-Box) for the Cum Effect [STEAM only, sorry]\n[url=https://www.nexusmods.com/palworld/mods/2221]Sexy Mozzarina (SFW and NSFW) at Palworld Nexus - Mods and community[/url]\nCaution! This file conflicts with Altermatic replacers that feature Mozzarina and as a result the pal looks deformed in game. If you want to use this file, you need to remove the entries for \"CowPal\" found in the .json files inside the SwapJSON folder for each altermatic pack that has Mozzarina.\n[/spoiler]\nUseful Additions:\n[spoiler]\n[u]No Fade Out v2[/u] so you can get close and see the action,\n[url=https://www.nexusmods.com/palworld/mods/2127]https://www.nexusmods.com/palworld/mods/2127[/url]\n[u]Hide Back Pack, Lantern, Weapons[/u] for unobstructed view [url=https://www.nexusmods.com/palworld/mods/584,]https://www.nexusmods.com/palworld/mods/584,[/url]\n[/spoiler]\n[i][b]Special Thanks: [/b][/i]\nMichael for the animation guide and SCake mod,\nBakkas and Lanz for the huge support and tips for creating animations and more,\nUnfairJackal for the models, xMenar and Boko for the rigs\nT-Box for the fluiiid effects\nAnyone contributing towards the BoneIndexCorrect asset sharing\nDiscord Links:\nJackal's Den\n[url=https://discord.gg/jYVzcbWV]https://discord.gg/jYVzcbWV[/url]\nThe Broken Chatbox:\n[url=https://discord.gg/aFsFbyxn]https://discord.gg/aFsFbyxn[/url]",
    "thumbnail": "https://static.loverslab.com/screenshots/monthly_2025_06/Screenshot2025-06-15102409.png.fc74728f2b43eecc34aa1b33bdc355dd.png"
  },
  "Bakkas's Animation Pack": {
    "root": "E:\\SteamLibrary\\steamapps\\common\\Palworld\\Pal\\Content\\Paks",
    "version": "v1.3.8",
    "file_id": "local",
    "file_name": "BakkasAnimPak_1.IrTA3UV_.3.8(STEAM).rar",
    "entries": [
      "~mods/",
      "~mods/AnimJSON/",
      "~mods\\AnimJSON\\BakkasAnimPakLegacy_Main.json",
      "~mods\\AnimJSON\\BakkasAnimPakLegacy_MultiActor.json",
      "~mods\\AnimJSON\\BakkasAnimPakLegacy_Special.json",
      "~mods\\AnimJSON\\BakkasAnimPak_Main.json",
      "~mods\\AnimJSON\\BakkasAnimPak_Special.json",
      "~mods/SwapJSON/",
      "~mods\\SwapJSON\\BakkasVSkin.json",
      "~mods\\BakkasAnimPak.pak",
      "~mods\\BakkasVSkin.pak"
    ],
    "local": true,
    "author": "Bakkas92",
    "description": "[https://www.loverslab.com/files/file/34824-scake-mod-bakkass-animation-pack/](https://www.loverslab.com/files/file/34824-scake-mod-bakkass-animation-pack/)\n[u][b]Bakkas[/b][b] Animation Pack[/b][/u]\n[b]A simple animation package for Scake.[/b]\nI mainly use HUMAN M and PAL F/M for my \"Normal\" animations.\nwill NEVER use a Human F.\nV animations are compatible with both genders.\n[b]Jackal's Den Discord[/b]\nyou can also find me here to share ideas for my next animations.\n[url=https://discord.gg/bPAzrmB7Y4]https://discord.gg/bPAzrmB7Y4[/url]\n[b]Requirements[/b]\n[b]Project Sugar Cake (SCake) [/b]\n[b][url=https://www.loverslab.com/files/file/33158-project-sugar-cake-scake-animation-and-stat-framework/]https://www.loverslab.com/files/file/33158-project-sugar-cake-scake-animation-and-stat-framework/[/url][/b]\n[b]NSFW Community Mesh Pack for Male nude Player[/b]\n[b][url=https://www.loverslab.com/files/file/33790-models-nsfw-community-mesh-pack-for-scake-animations/]NSFW Community Mesh Pack for SCake animations[/url][/b]\n[color=#e3e3e3][b]Altermatic[/b][/color]\n[color=#e3e3e3][url=https://www.loverslab.com/files/file/34727-altermatic-runtime-replacer-framework/]\"HERE\"[/url][/color]\n[color=#e3e3e3]to use Jackal pack and Vskin pack[/color]\n[b]Palicious![/b]\n[url=https://www.loverslab.com/files/file/41283-palicious-scake-gameplay-mod/]HERE![/url]\nAll my animations work naturally with this mod, try it!\nand remember to put the Aggressor at 3-4, it also works with multi actor animations!\ngo to Scake options and enable \"Anyone\", it will be useful for a future idea.\n[spoiler]\n[img]https://www.loverslab.com/uploads/monthly_2025_05/sfdfdgd.PNG.6ef9d83d2cf334b8bce8e6abea598be5.PNG[/img]\n[img]https://www.loverslab.com/uploads/monthly_2025_05/afdxzfsdfsd.PNG.235d3f67da5acec76c0c59d560057911.PNG[/img]\n[/spoiler]\n[b]Female/Male Pal Mesh By UnfairJackal Available on TBC Discord Server[/b]\n[url=https://discord.gg/h3vB7S4FEw]The Broken Chatbox[/url] I use it for a lot of my female animations.\nYou will find the package in r18_mod_relase - UnfairJackal Pals\n[b]Or Here[/b]\n[url=https://www.loverslab.com/files/file/35941-altermatic-unfairjackal-pals-mostly-anatomically-correct-43x-models-includes-mft-and-counting/]UnfairJackalPal Pack[/url] (over 100% of my animations are based on these models ❤️ )\n[b]Instalation Guide...[/b]\n[spoiler]\nDownlod BakkasAnimPak and extract it.\nIf you have Steam just go to your library, right click on the \"palworld\" game, browse local files.\nPut BakkasAnimPak.pak to the ~mods folder at \\Palworld\\Pal\\Content\\Paks\\~mods\nand BakkasAnimPak.json to the AnimJSON folder \"which should be found inside the ~mods folder\"\nAdd \"BakkasAnimPak\" to the _LoadList.json\nPS:\nIf you have done all the steps correctly but the mod does not work, it means that you have skipped some steps in installing Scake, be careful. XD\n[/spoiler]\n[b]instructions for starting animations with the new SCake[/b]\n[b]Press J to select yourself, press G to select the interested Pals (the names will appear at the top left) hold down H to start the animation.\nto deselect the Pals press H[/b]\n[b]New Vskin Pack: [/b]\nI'm making a skin pack with custom bones to spice up the animations, it's in beta now and many skins are disabled (you can find them in the JSON file and enable them if you want).\nthey are very easy to recognize, they have a V drawn on them.\na special thanks to T-box for allowing me to modify some of his models.\n[spoiler]\n[img]https://www.loverslab.com/uploads/monthly_2025_05/sdgsdgsdgsdg.PNG.982a50066847a5fec9eb73105eb9064b.PNG[/img]\n[/spoiler]\n[b]Vore Warning![/b]\n[spoiler]\n[b]Yes, I have also received requests for Vore animations, so I decided to try to make those animations too (only on request).\nTo avoid mixing too many animations in one file I decided to attach a small package where I will upload only vore animations.\nthe V Skin Pack created by Jackal and Me It is located directly inside the V package[/b]\n[/spoiler]\n[u][b]Tip Jar[/b][/u]\nThank you for your support [url=https://linktr.ee/Bakkas92]\"HERE\"\nAny suggestions and criticisms are always appreciated ❤️",
    "thumbnail": "https://static.loverslab.com/screenshots/monthly_2025_06/wersefrsefr.PNG.f17eca0691f79d6af0464eb61db771d5.PNG"
  },
  "Menar's Animation Pack": {
    "root": "E:\\SteamLibrary\\steamapps\\common\\Palworld\\Pal\\Content\\Paks",
    "version": "v1.5.5",
    "file_id": "local",
    "file_name": "MenarAnimPak_1.5.5 [Steam].7z",
    "entries": [
      "~mods/",
      "~mods/AnimJSON/",
      "~mods\\AnimJSON\\MenarAnimPak.json",
      "~mods\\MenarAnimPak.pak"
    ],
    "local": true,
    "author": "xMenar_",
    "description": "[https://www.loverslab.com/files/file/39646-menars-animation-pack/](https://www.loverslab.com/files/file/39646-menars-animation-pack/)\n[b]An Animation Package for Palworld[/b]\n[b]This Animation Pack contains a mix of Pal x Pal and Human x Pal animations, for both male and female characters and[/b]\n[b]a small Vore Pack separate from the Main Pack.[/b]\n[u][b]Old Animations[/b][/u][b]  [/b][b](Outdated - Does not work with SCake 0.6+) [/b]\nAfter several requests about the old animations that were removed with version 1.4.4, I decided to make them available as a separate animation pack.\nIt contains almost all of the old animations, the animations that I have already reworked have not been added to avoid unnecessary duplicate animations.\nThe “MenarAnimPak_Old_Animations” requires the Community Mesh Pack. If you are not using this animation pack, you do not need to install the Mesh Pack!\n[b]Important! Object animations only works with [/b][b]SCake 0.6.3+[/b][b], this feature is buggy in older versions![/b]\n[b]The latest SCake version is currently only available on TBC.[/b]\n[b]Discord link:[/b][b] [url=]The Broken Chatbox[/url][/b]\n[b]Menar's Animation Pack - Animation List:[/b]\n[spoiler]\n[u][b]Menar's Animation Pack - Animation List[/b][/u]\n[b]Pal x Pal Animations and Pal Solo Animations:[/b]\nEikthyrdeer x Reindrix Doggystyle Animation [M x M/F]\nLeezpunk x Leezpunk Behind Animation [M x F]\nMozzarina x Mozzarina Doggystyle Animation [M x F]\nBoss Nitewing x Nitewing Cowgirl Animation [BOSS-M x F]\nArsox x Arsox Doggystyle Animation [M x F]\nBeegarde Solo Mastubation Animation [M]\nTanzee Solo Blowjob Animation [M]\nRushoar x Rushoar Boar Love Animation [M x F]\nDepresso x Depresso depressed Mating [M x M/F]\nRobinquill Solo Masturbation on Large Pal Bed [Robinquill M + Pal Bed Large]\nGaleclaw Doggystyle Robinquill - Galeclaw x Robinquill [M x F]\nVerdash Bredding farm mating - Verdash x Verdash + Breeding Farm [M x F]\nGrizzbolt Mating - Grizzbolt x Grizzbolt [M x F]\n[b]Pal x Human Animations:[/b]\nDinossom x Human Doggystyle Animation [M x M/F]\nKitsu x Human Doggystyle Animation [M x M/F]\nReindrix x Human Doggystyle Vaginal Animation [M x F]\nReindrix x Human Doggystyle Anal Animation [M x M/F]\nHuman x Reindrix Mating Animation [F x M]\nReindrix x Human Mating Anal Animation [F x M]\nAnubis x Human Cowgirl 2 Animation [M x M/F]\nFoxcicle x Human Doggystyle [M x M/F]\nFoxcicle x Human Knotfuck [M x M/F]\nFoxcicle x Human Cowgirl Animation [M x M/F]\nNitewing x Human Mating Animation [F x M]\nBlazamut x Human Doggystyle Animation [M x M/F]\nRobinquill/Robinquill Terra x Human Standing Animation [M x M/F]\nLeezpunk x Human Missionary Animation [M x M/F]\nKelpsea x Human Doggystyle Anal Animation [M x M/F]\nMozzarina x Human Vaginal Animation [F x M]\nCinnamoth x Human Anal Animation [M x M/F]\nRagnahawk x Human Doggystyle Anal Animation [M x M/F]\nGrizzbolt x Human Cowgirl, Missionary Animation [F x M]\nGrizzbolt x Human Standing Outside, Cowgirl Animation [M x M/F]\nFuddler x Human Fuddlerstyle Animation [M x M/F]\nFuddler x Human Cowgirl Animation [M/F x M]\nVanwyrm/Vanwyrm Cryst x Human Belly riding Animation [M x M/F]\nEikthyrdeer/Eikthyrdeer Terra x Human Belly riding Animation [M x M/F]\nGorirat/Gorirat Terra x Human Missionary Animatioen [M x M/F]\nCaprity x Human defeated Animation [M x M/F]\nKitsun x Human Mating Animation [M x M/F]\nXenogard x Human Mating Animation [M x M/F]\nAnubis x Human X Anubis Douple Pack Animation [M x F x M]\nElphidran/Elphidran Aqua x Human, Love for Elphidran Animation [F x M]\nWarsect x Human Doggystyle Animation [M x F/M]\nMenasting/Menasting Terra Missionary  Animation [M x F/M]\nGobfin/Gobfin Ignis Gangbang Animation [M x M x M x M/F] [3x Gobfin 1x Human]\nChillet/Chillet Ignis Love Animation [M x M/F]\nVanwyrm/Vanwyrm Cryst Fun Animation [M x M/F]\nHuman behind Chikipi Animation [M/F x M]\nTombat double Fun Animation [M Tombat x F Tombat x M Human]\nBoss Smokie x Human Mating Press Animation [M x F]\nLunaris x Human Blowjob Animation [M x M/F]\nReptyro x Human Mating Animation [M x M/F]\nAdded Wixen Cowgirl Animation Wixen x Human [M x M/F]\nAdded Wixen On Top Animation Wixen X Human [M x M/F]\nAdded Cryolinx Cowgirl Animation Cryolinx x Human [M x M/F]\nFoxparks Mating Animation Foxparks x Human x Foxparks [M x M x F]\nFoxparks Doggystyle Animation Foxparks x Human [M x M/F]\nBeakon Mating Press Animation Beakon x Human [M x M/F]\nShadowbeak Lying Animation Shadowbeak x Human [M x M/F]\nSparkit x Human Missionary Animation [M x F]\nBlazamut Doggystyle remake Animation Male Anal Version Blazamut/Blazamut Ryu x Human [M x M]\nBlazamut Doggystyle remake Animation Female Vaginal Version Blazamut/Blazamut Ryu x Human [M x F]\nBlazamut Missionary Animation Blazamut/Blazamut Ryu x Human [F x M]\nBastigors new toy Vaginal Version Animation Bastigor x Human [M x F]\nBastigors new toy Anal Version Animation Bastigor x Human [M x M]\nOrserk Mating Press Vaginal Animation Orserk x Human [M x F]\nOrserk Mating Press Anal Animation Orserk x Human [M x M]\nOrserk Dominant Doggystyle Vaginal Animation Orserk x Human [M x F]\nOrserk Dominant Doggystyle Anal Animation Orserk x Human [M x M]\nXenolord Cowgirl Animation Xenolord x Human [M x F]\nUnivolt rimming Animation Univolt x Human [M/F x M/F]\nRushoar Doggystyle Animation Rushoar x Human [M x M/F]\nKikit on Back Animation Kikit x Human [M x M/F]\nCattiva on Wood Chest - Cattiva x Human + Wooden Chest [M x M/F]\nWarsect Lotus - Warsect/Warsect_Ground x Human [M x M/F]\nMammorest grinding - Mammorest/Mammorest Crystal x Human [M x F]\n[/spoiler]\n[b]Vore Package:[/b]\nJormuntide/Jormuntide Ignis x Human Hungry Jormuntide Animation [M x M/F]\nCroajiro Missionary Animation Croajiro x Human [M x M/F]\n[u][b]Menar's Old Animation Pack - Animation List[/b][/u]\n[spoiler]\n[u][b]MenarAnimPak Old Animations - Animation List[/b][/u]\n[b]Pal x Pal Animations:[/b]\nLovander x Lovander Oral Animation [M x F]\nManticore x Quivern Cowgirl Animation [M x M/F]\nDepresso x Daedream Standing Vaginal Animation [M x M/F]\nTombat X Direhowl Doggystyle Animation [M x M/F]\nCattiva X Cattiva Missionary Animation [M x M/F]\nChillet x Chillet Laying Animation [M x M/F]\nAnubis x Lamball Missionary Animation [M x F]\nFoxparks x Foxparks Blowjob Animation [M x M/F]\nMelpaca x Melpaca Doggystyle Animation [M x F]\nIncineram x Incineram Doggystyle Animation [M x M/F]\nQuivern x Quivern behind Animation [M x M/F]\nDirehowl x Direhowl Doggystyle Animation [M x M/F]\nDinossom x Dinossom Gay Mating Animation [M x M]\nBlazehowl x Jetragon Doggy Animation [M x M/F]\nGaleclaw x Galeclaw Facefuck Animation [M x M/F]\nRayhound x Rayhound Doggstyle Animation [M x M/F]\n[b]Pal x Human Animations:[/b]\nRayhound x Human Handjob Animation [M x M/F]\nBeakon x Human Reverse Cowgirl Animation [M x M/F]\nNox x Human Missionary Animation [M x M/F]\nChillet x Human Handjob Animation [M x M/F]\nAnubis x Human Cowgirl Animation [M x M/F]\nMammorest x Human Handjob Animation [M x M/F]\nTombat x Human Holding Animation [M x M/F]\nIncineram x Human Holding Animation [M x M/F]\nJetragon x Human Doggystyle Animation [M x M/F]\nGaleclaw x Human Doggystyle Animation [M x M/F]\nFoxparks x Human Missionary Animation [M x F]\nQuivern x Human Serviced Animation [M x M/F]\nBeakon x Human push-up training Animation  [M x M/F]\nLovander x Human Cowgirl Animation [M x M/F]\nLoupmoon x Human Standing Outside Animation [M x M/F]\nLamball x Human Fisting Animation [F x M/F]\nRayhound x Human Cowgirl Animation [M x M/F]\nAnubis x Human Reverse Cowgirl Animation [M x M/F]\nLoupmoon x Human Holding Anal Animation [M x M/F]\nBeakon x Human \"Beakon Wild Doggy\" Animation [M x M/F]\nMammorest x Human Bodyjob Animation [M x M/F]\nNox x Human Doggystyle Animation [M x M/F]\nShadowbeak x Human Doggystyle Animation [M x M/F]\nGumoss x Human Animation [F x M]\nLoupmoon x Human Cowgirl Animation [M x M/F]\nAnubis x Human Cowgirl 2 Animation [M x M/F]\n[/spoiler]\n[u][b]Installation Instructions[/b][/u]\n[spoiler]\nDownload the zip file and unzip it with an unzipping program.\nOpen your Palworld main directory folder and go to \\Palworld\\Pal\\Content\\Paks\\~mods\nOpen the unzipped mod folder \"MenarAnimPak\"\nIn the folder you should find a \"~mods\" folder as well as a \"MenarAnimPak - Changelog\" and a \"ReadMe\" file.\nOpen the \"~mods\" folder...\n[STEAM] In the \"~mods\" folder you will find another folder \"AnimJSON\" as well as a \"MenarAnimPak.pak\" file\n[Gamepass] In the folder \"~mods\" you will find another folder \"AnimJSON\" and 3 files \"MenarAnimPak.pak\", \"MenarAnimPak.ucas\" and \"MenarAnimPak.utoc\"\n[STEAM] Drag the \"MenarAnimPak.pak\" file into your Palworld main directory folder at \\Palworld\\Pal\\Content\\Paks\\~mods\n[Gamepass] Drag the files \"MenarAnimPak.pak\", \"MenarAnimPak.ucas\" and \"MenarAnimPak.utoc\" into your Palworld main directory folder under\n\\Palworld\\Pal\\Content\\Paks\\~mods\nSwitch back to the \"MenarAnimPak\" folder and open the \"AnimJSON\" folder\nIn the\" AnimJSON\" folder you will find another file \"MenarAnimPak\"\nDrag the file into your Palworld main directory folder at \\Palworld\\Pal\\Content\\Paks\\~mods\\AnimJSON\nNow we just have to register the animation package.\nTo do this we have to go to the Palworld main directory.\nDrag the file \"MenarAnimPak\" into your AnimJson folder at:\nC:\\Program Files (x86)\\Steam\\steamapps\\common\\Palworld\\Pal\\Content\\Paks\\~mods\\AnimJSON\nNow click on the bat file \"__Create_Load_List__\"\nThe animation package should now be registered and ready to use.\nRegister animation package without the \"Bat\" file..\nOpen the file \"_LoadList\"\nAdd \"MenarAnimPak\" to the \"_LoadList.json\"\nFor the Vore package the same but for the \"MenarAnimPak_Vore\" Json\nThe Animation package should now be registered and ready to use.\nDon't forget to install the requirements correctly!\n[/spoiler]\n[u][b]Requirements[/b][/u]\nBy Spirit_Shard[/url]\n[b][url=https://www.loverslab.com/files/file/33158-project-sugar-cake-scake-animation-and-stat-framework/]Project Sugar Cake (SCake) [Animation and Stat Framework][/url][/b]\n[b][url=https://www.loverslab.com/files/file/34727-altermatic-runtime-replacer-framework/]Altermatic - Runtime Replacer Framework[/url][/b]\n[b][url=https://www.loverslab.com/files/file/37188-unipalui/]UniPalUI[/url][/b]\nBy UnfairJackal[/url]\n[b][url=https://www.loverslab.com/files/file/35941-altermatic-unfairjackal-pals-mostly-anatomically-correct-140163-and-counting-male-female-some-futa/]UnfairJackal Pals. Mostly Anatomically correct[/url][/b]\nBy xMenar_[/url] and TemtemLover[/url]\n[b][url=https://www.loverslab.com/files/file/40109-sounds-palsoundbank-mod-resources-for-modders-for-animation-montages/][Sounds] PalSoundBank - Mod + Resources[/url][/b]\n[u][b]Only needed for the old animation package![/b][/u]\nBy TemtemLover[/url]\n[b][url=https://www.loverslab.com/files/file/33790-models-nsfw-community-mesh-pack-for-scake-animations/]NSFW Community Mesh Pack for SCake animations [/b]\n[u][b]Recommended[/b][/u]\n[b][url=https://www.nexusmods.com/palworld/mods/2127]No Fade Out Pal[/b]\nPrevents Pals from becoming invisible when zooming too close.\n[b][url=https://discord.gg/dGypeJ2EtE]Jackal´s Den Discord[/b]\nA Palworld Modding Discord by UnfairJackal, Bakkas92 and xMenar_\nLearn everything about our projects, share your work with the community or just hang out with us! Everyone is welcome :3\n[b][url=https://www.loverslab.com/files/file/41283-palicious-scake-gameplay-mod/]Palicious![/b]\nAdds some useful features for SCake\n[u][b]Support me on KoFi[/b][/u]\nKoFi account to collect tips. [url=https://ko-fi.com/menarx79386]https://ko-fi.com/menarx79386",
    "thumbnail": "https://static.loverslab.com/screenshots/monthly_2025_06/grizz.PNG.a6d33eb24f40c04b9f49f8a979e9fd9c.PNG"
  },
  "Loupmoon Dick": {
    "root": "E:\\SteamLibrary\\steamapps\\common\\Palworld\\Pal\\Content\\Paks\\~mods",
    "version": "v1.0.0",
    "file_id": "local",
    "file_name": "Loupmoondick_P.zip",
    "entries": [
      "Loupmoondick_P.pak"
    ],
    "local": true,
    "author": "mitamasama",
    "description": "[url=https://www.loverslab.com/files/file/32057-loupmoon-dick/]https://www.loverslab.com/files/file/32057-loupmoon-dick/[/url]\nThis mod gives Loupmoon a dick, balls and a butthole. Based on [url=https://www.loverslab.com/profile/11064175-vixieyote/]@VixieYote[/url]'s [url=https://www.loverslab.com/topic/225549-project-sugar-cake-sex-and-stat-framework-gameplay-mod/#comment-4298937]design[/url].",
    "thumbnail": "https://static.loverslab.com/screenshots/monthly_2024_02/loupmoon6.png.62ad5a7f5a176f7b9a678b2dc0b65eac.png"
  },
  "NSFW Community Mesh Pack for SCake animations": {
    "root": "E:\\SteamLibrary\\steamapps\\common\\Palworld\\Pal\\Content\\Paks",
    "version": "v1.7",
    "file_id": "local",
    "file_name": "MeshPack1_7_AUGUST24_STEAM.zip",
    "entries": [
      "~mods/",
      "~mods/SwapJSON/",
      "~mods\\SwapJSON\\CommunityMeshesPak.json",
      "CommunityMeshPackv1_7_P.pak",
      "NudeMalev1_3_P.pak"
    ],
    "local": true,
    "author": "TemtemLover",
    "description": "[url=https://www.loverslab.com/files/file/33790-models-nsfw-community-mesh-pack-for-scake-animations/]https://www.loverslab.com/files/file/33790-models-nsfw-community-mesh-pack-for-scake-animations/[/url]\nThis meshpack is aimed to provide animators an easier base to work with for NSFW animations and to simplify modding process for Palworld.\nStyle wise meshpack aims to not change proportions or anthro-fy any pal. In other words, feral pals remain feral. However anthro pals may receive skimpier/sexier bodyshapes for females, but that's as much of a change there will be.\nIf you are interested in the .blend file with all rigged models (yes, ALL of them) - visit SCake discord at #r18_modding. That file is a chungus, so for now I am pondering where to upload it.\n[b]Main features:[/b]\n- [b]Male and Female[/b] distinction between supported pals\n- [b]Aroused [/b]system controlled by SCake (as of now males junk appear flaccid when not aroused)\n- [b]Jiggles [/b]for bodyparts for males and some female models (more are going to be added over time)\n- A couple of unique pal appearances as a Lucky pal.\n- (WIP) Some models are set up for future addon that will allow unclothing, via interface or combat.\n- [u]OPTIONAL[/u] rudimentary Male mesh download, it is not of the greatest quality, breaks character creator sliders, but is is a good as it gets atm, we are praying someone to make a good male model.\n[b]Current content:[/b]\n[u]Female + Male models:[/u]\nBeegarde, Cattiva, Chillet, Direhowl, Foxpark, Elizabee, Foxicle, Incineram, Katress, Lovander, Depresso, Flopie, Fenglope, Kitsun, Melpaca, Rayhound, Lunaris, Petalia, Lyleen, Wixen, Blazehowl, Jetragon, Reindrix, Shadowbeak, Quivern, Daedream, Orserk, Dazemu, Loupmoon, Nitewing, Bushy\n[u]Only males:[/u]\nAnubis, Cinnamoth, Daedream, Dinossom, Eithyrdeer, Galeclaw, Tombat, Blazamut, Maraith,  Mammonthrest\n[u]Only Females:[/u]\nLamball\n[b]Installation![/b]\n[spoiler]\nUsing new and Shiny Altermatic\n- Install [url=https://www.loverslab.com/files/file/34727-altermatic-runtime-replacer-framework/]Altermatic[/url]\n- Extract STEAM version if you are on steam, or MICROSOFT version if you are on xbox/gamepass into [i]`Palworld\\Pal\\Content\\Paks` [/i]\n- [i](Delete NudeMale if you don't want to change your main male character)[/i]\n- Go into [i]`Palworld\\Pal\\Content\\Paks\\~mods\\SwapJSON` [/i]and run  [b]__Create_Load_List__.bat[/b]\nFeel free to edit CommunityMeshesPak.json as you wish. In further releases it'll get more features and proper naming, as of it is a bit of wip.\nUsing OK method (only STEAM, [u][b]not recommended [/b][/u]as we are moving over from abandoned OK)\n- Install [url=https://www.nexusmods.com/palworld/mods/524]One of a Kind[/url] (outdated and not recommended\n- Extract  STEAM version  into [i]`Palworld\\Pal\\Content\\Paks` (Delete NudeMale if you don't want to change your main character)[/i]\n- Make sure you are aware if other mods overwrite pals present in the meshpack. [b]Non OK models will remove male/female distinction.[/b]\nOK Method is longer supported due to having to use old blueprints and lack of new features.\n[/spoiler]\n[b]Credits![/b]\n[spoiler]\nNote that all the contributors gave their OK to be included in this meshpack!\nTemtemLover/Limpid Plume(OP) - Coordinator and Assembler of the modpack.\n[url=https://www.loverslab.com/profile/730126-bokonus/]@bokonus[/url] - Provider of all genitalia and assembler of the .blend file with all resources.\n[url=https://next.nexusmods.com/profile/alfiearmadillo/mods?gameId=6063]alfiearmadillo[/url]: Blazehowl, Reindrix, Jetragon, Shadowbeak\n[url=https://www.loverslab.com/profile/10403399-paulitoz/]@PaulitoZ[/url] : Chillet, Depresso, Flopie, Cattiva, Quivern, Sheep, Daedream\n[url=https://www.loverslab.com/profile/11134242-fjolt/]@FJolt[/url]: Fenglope, Foxparks, Kitsun, Melpaca, Rayhound, Direhowl\n[url=https://next.nexusmods.com/profile/ricardonu/mods?gameId=6063]T-box[/url]: Lunaris, Petalia, Elizabee, Beegarde, Lyleen, Wixen, Katress, Lovander, Incineram, Cremis, Bushy\n[url=https://www.loverslab.com/profile/1856995-galerysoro/]@galerysoro[/url] Aka Zephyr Panthur: Maraith, Dazemu\n[url=https://twitter.com/Zarphus]Zarphus[/url]: Lovander, Anubis, Shadowbeak, Orserk, Blazamut\n[url=https://www.loverslab.com/profile/11093180-unfairjackal/]@UnfairJackal[/url]: Nitewing\n[url=https://www.loverslab.com/profile/4531454-mitamasama/]@mitamasama[/url]: Loupmoon\nShow some support to these people if you want to see more models!\n[/spoiler]\n[b]Vanilla assets replacements note! [/b]\n[spoiler]\n[s]While almost entirety of the pack is build on Altermatic - there are a few things that I don't know yet how to recreate material wise, namely emission.[/s]\n[s]Orserk replacement is done via texture swap to retain the glow.[/s]\n[s]This list will get updates if more pals will receive same treatment.[/s]\n[s]For now:[/s]\n[s][b]IF you want to disable vanilla asset[/b] replacements (for any reason, like adding another mod that also does that) - [b]remove _P from the name of the .pak file[/b][/s]\n[s]This will allow other mods take over, while rest of the pack continues to function.[/s]\n[s]The moment somebody shares info about how to create custom material with emmissions that are pal-like, I'll remove this replacement.[/s]\nStuff has been figured out and vanilla assets no longer being swapped!\n[/spoiler]\n[b]TODO AND THOUGHTS:[/b]\n- Some textures are probably setup incorrectly\n- Male junk tend to de-glue from the crotch due to lack of weight painting. This will be polished over time per-model.\n- Pal variants are not added yet, but will be soon enough.\nPlease report any issues, lack of genitalia, textures or whatever in here or to my discord (TemtemLover)!\n[b]If you wish to share your female mesh models - [/b]also do let me know!  If you already have some published and are okay with me putting them into this pack - we can figure it out.",
    "thumbnail": "https://static.loverslab.com/screenshots/monthly_2024_05/ezgif-6-0307f5fe02.gif.cd1a1fbede23aa1ef1edafa2c7a563fd.gif"
  },
  "Altermatic UnfairJackal Pals. Mostly Anatomically correct 159/186 and Counting. (Male, Female, Some Futa)": {
    "root": "E:\\SteamLibrary\\steamapps\\common\\Palworld\\Pal\\Content\\Paks",
    "version": "v1.2.7",
    "file_id": "local",
    "file_name": "UnfairJackal_Pals_V1.2.7.7z",
    "entries": [
      "~mods/",
      "~mods/SwapJSON/",
      "~mods\\SwapJSON\\ZUnfairJackal_Pals.json",
      "~mods\\CursedFemaleGumoss.pak",
      "~mods\\UnfairJackal_Pals.pak"
    ],
    "local": true,
    "author": "UnfairJackal",
    "description": "[url=https://www.loverslab.com/files/file/35941-altermatic-unfairjackal-pals-mostly-anatomically-correct-159186-and-counting-male-female-some-futa/]https://www.loverslab.com/files/file/35941-altermatic-unfairjackal-pals-mostly-anatomically-correct-159186-and-counting-male-female-some-futa/[/url]\nI've recently just started modding with pals, i'm still quite new to this however, i'm slowly making NSFW models for each pal which will cover both genders along with SCake compatible morphs for erect penises. My models are by no means perfect but, i will continue to improve and create new models! I'm not following any strict lists or anything, just simply making them in a random order to cover any pals that may not have a model yet.\n\nThese are the list of Pals I've currently done and will continue to add more!\n\nFemale Pals Include: Anubis, Arsox, Azurobe, Astegon, Beakon, Blazamut, Blazamut Ryu, Blazehowl, Blazehowl Dark, Broncherry, Broncherry water, Caprity, Cattiva, Cawgnito, Celaray, Chikipi, Chillet, Chillet Ignis, Cinnamoth, Cremis, Cryolinx, Croajiro, Digtoise, Dumud, DaeDream, Dazemu, Depresso, Dinossom, Dinossom Electric, Direhowl, Eikthyrdeer, Eikthyrdeer Terra, Elphidran, Elphidran Water, Faleris, Fenglope, Foxicle, Foxparks, Frostallion, Frostallion Noct, Fuack, Fuddler, Flopie, Felbat, Galeclaw, Goriat, Goriat Terra, Gobfin, Gobfin\\_Ignis, Grintale, Grizzbolt, Gumoss, Helzephyr, Helzephyr Electric, Hoocrates, Hangyu, Hangyu Cryst, Incineram, Incineram Noct, Jormuntide, Jormuntide Ignis, Jolthog, Jolthog Ice, Jetragon, Kelpsea, Kelpsea Ignis, Kingpaca, Kingpaca Cryst, Kitsun, KitKit, Lamball, Leezpunk, Leezpunk Ignis, Lifmunk, Lovander, Loupmoon, Lullu, Lunaris, Maraith, Mau, Mau Cryst, Mammorest, Mammorest Ice, Mozzarina, Mossanda, Mossanda Lux, Melpaca, Menasting, Menasting\\_Ground, Necromus, Nitewing, Nox, Paladius, Pengullet, Penking, Pyrin, Pyrin Dark, Quivern, Quivern Botan, QueenBee, Ragnahawk, Rayhound, Reindrix, Relaxarous, Relaxaurus Lux, Ribbuny, Robinquill, Robinquill Ground, Rooby, Rushroar, Reptyro, Reptyro\\_Cryst, ShadowBeak, Sparkit, Surfent, Surfent Terra, Suzaku, Suzaku Water, SoldierBee, Shroomer, Shroomer Noct, Tanzee, Teaphant, TocoToco, Tombat, Univolt, Vaelet, Vanwyrm, Vanwyrm Cryst, Vixy, Warsect, Warsect Ground, Wumpo, Wumpo Botan, Woolipop, Wixen, Wixen Dark, Xenogard, Xenovader, Yakumo\n\nMale Pals Include: Anubis, Arsox, Azurobe, Astegon, Beakon, Blazamut, Blazamut Ryu, Blazehowl, Blazehowl Dark, Broncherry, Broncherry water, Caprity, Cattiva, Cawgnito, Celaray, Chikipi, Chillet, Chillet Ignis, Cinnamoth, Cremis, Cryolinx, Croajiro, Digtoise, Dumud, DaeDream, Dazemu, Depresso, Dinossom, Dinossom Electric, Direhowl, Eikthyrdeer, Eikthyrdeer Terra, Elphidran, Elphidran Water, Faleris, Fenglope, Foxicle, Foxparks, Frostallion, Frostallion Noct, Fuack, Fuddler, Flopie, Felbat, Galeclaw, Goriat, Goriat Terra, Gobfin, Gobfin\\_Ignis, Grintale, Grizzbolt, Helzephyr, Helzephyr Electric, Hoocrates, Hangyu, Hangyu Cryst, Incineram, Incineram Noct, Jormuntide, Jormuntide Ignis, Jolthog, Jolthog Ice, Jetragon, Kelpsea, Kelpsea Ignis, Kingpaca, Kingpaca Cryst, Kitsun, KitKit, Lamball, Leezpunk, Leezpunk Ignis, Lifmunk, Lovander, Loupmoon, Lullu, Lunaris, Maraith, Mau, Mau Cryst, Mammorest, Mammorest Ice, Mozzarina, Mossanda, Mossanda Lux, Melpaca, Menasting, Menasting\\_Ground, Necromus, Nitewing, Nox, Paladius, Pengullet, Penking, Pyrin, Pyrin Dark, Quivern, Quivern Botan, QueenBee, Ragnahawk, Rayhound, Reindrix, Relaxarous, Relaxaurus Lux, Ribbuny, Robinquill, Robinquill Ground, Rooby, Rushroar, Reptyro, Reptyro\\_Cryst, ShadowBeak, Sparkit, Surfent, Surfent Terra, Suzaku, Suzaku Water, SoldierBee, Shroomer, Shroomer Noct, Tanzee, Teaphant, TocoToco, Tombat, Univolt, Vaelet, Vanwyrm, Vanwyrm Cryst, Vixy, Warsect, Warsect Ground, Wumpo, Wumpo Botan, Woolipop, Wixen, Wixen Dark, Xenogard, Xenovader, Yakumo\n\nFuta Pals Include: Fuddler (Required \"Abnormal\" Trait on Males), Dinossom (Required \"Abnormal\" Trait on Males) and Dinossom Electric (Required \"Abnormal\" trait on Males).\n\nI don't have any pictures yet, but i will add them soon!\n\nI'm adding this link here as requested by someone. I do not do these models for money at all, but they were insistent. Donations can be made here: ko-fi/UnfairJackal -> Cannot publish official link for reasons -\\_-\n\nFor this mod to work you will need the following:\n\nUE4SS : [url=https://github.com/UE4SS-RE/RE-UE4SS/releases]https://github.com/UE4SS-RE/RE-UE4SS/releases[/url]\n\nAltermatic : [url=https://www.loverslab.com/topic/233030-modaltermatic-runtime-replacer-framework/]https://www.loverslab.com/topic/233030-modaltermatic-runtime-replacer-framework/[/url]\n\nInstallation instructions for my mod are very simple once the above have been set up.\n\n1\\. Download Zip and extract.\n2\\. Place the .Pak file in the \"~mods\" Folder.\n3\\. Place the .Json file inside of \"SWAPJson\" folder. (SWAPJson folder can be found inside ~mods folder).\n4\\. Run the \"load list .bat\" to include the pak in the load order.\n5\\. Enjoy.\n\nAll other instructions on how to setup Altermatic can be found on the page.\n\nRecommended mods:\n\nProject Sugar Cake (SCake) : [url=https://www.loverslab.com/topic/229303-modsugar-cake-animation-framework-scake-animation-and-stat-framework/]https://www.loverslab.com/topic/229303-modsugar-cake-animation-framework-scake-animation-and-stat-framework/[/url]\n\nMy Pals within my mod have an erect version of each male which can only be seen once they reach an \"Aroused\" period which is all integrated into Scake which allows for animations. Check it out!\n\nAnimators who have used my models which have them included in there pack are listed below as well :\n\n[url=https://www.loverslab.com/topic/233277-modscake-mod-bakkass-animation-pack/]https://www.loverslab.com/topic/233277-modscake-mod-bakkass-animation-pack/[/url]\n[url=https://www.loverslab.com/topic/232740-modscake-feroxs-animation-pack/]https://www.loverslab.com/topic/232740-modscake-feroxs-animation-pack/[/url]\n[url=https://www.loverslab.com/topic/234980-modscake-lurkers-animation-pack/]https://www.loverslab.com/topic/234980-modscake-lurkers-animation-pack/[/url]",
    "thumbnail": "https://static.loverslab.com/screenshots/monthly_2024_09/Screenshot2024-09-28015038.png.c1f32fb62f77d3a5869ab84870ced24e.png"
  }
}